<?php

namespace Database\Seeders;

use App\Models\Comment;
use App\Models\Disease;
use App\Models\Plant;
use App\Models\PlantSchedule;
use App\Models\Post;
use App\Models\Stage;
use App\Models\Step;
use App\Models\User;
use App\Models\UserPlant;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        

        //  PLANTS


        $plant = Plant::create();
        $plant->name = "الطماطم";
        $plant->description = "نبات الطماطم هو نبات عشبي وثنائي الفلقة. يشكل النبات جذرًا كومة ينمو إلى عمق يصل إلى مترين (6.6 قدم). تنمو فيها الكرمات والتي تنمو كسيقان متفرعة. في الأعلى يوجد برعم طرفي. عندما يتوقف هذا البرعم عن النمو، يأخذ النبات الإشارة لبدء نمو البراعم المحيطية وبالتالي الكروم الجديدة. عادة ما تكون أوراق الطماطم مركبة ؛ ومع ذلك، فإن بعض الأصناف لها أوراق بسيطة بطول 10-25 سم (4-10 بوصات)، ريشية الشكل وبها 5-7 وريقات. يغطي كل من الكروم والأوراق شعر صغير.
        \r\n \r\n  تكون الزهور صفراء اللون وبها خمسة فصوص على تويج الزهرة. يبلغ قطرها 1-2 سم (0.4 – 0.8 بوصة) وتنمو على النسيج الإنشائي القمي. الثمار عبارة عن توت ببذور صغيرة بيضاوية إلى مستديرة الشكل ومسطحة وذات لون مائل إلى الاصفرار.
        \r\n \r\n  أهم الاحتياجات البيئية لزراعة الطماطم:\r\n \r\n 
       \r\n \r\n .التربة المناسبة التي لا تحتوي على نسبةٍ عاليةٍ من الملوحة؛ لتفادي إصابة النبتة بالأمراض الفطرية.
       \r\n \r\n.الضوء من أهم الاحتياجات خلال مرحلة النمو الخضري، وتحتاج نبتة الطماطم إلى ستةِ ساعات من ضوء الشمس غير المباشر للنمو بشكلٍ سليم.
       \r\n \r\n.الحرارة المثلى لنمو الطماطم تتراوح ما بين خمس وعشرين درجةٍ إلى ثلاثين درجةٍ مئوية.
       \r\n \r\n.الرطوبة من العوامل التي تزيد جودة الإنتاج لنبات الطماطم، ويجب أن تتراوح ما بين 60-65%
       \r\n \r\n.التهوية، والتسميد، والريّ من أهم العوامل الواجب توافرها في التربة الجيّدة للحصول على محصولٍ جيد.";
         $plant->season = "spring";
        $plant->image = "tomato.png";
        $plant->save();


        //        //DISEASES




        $disease1 = Disease::create();
        $disease1->name = "فيروس تجعد واصفرار أوراق الطماطم";
        $disease1->description = "الاسم العلمي TYLCV";
        $disease1->symptoms = "عندما يصيب فيروس تجعد واصفرار أوراق الطماطم النباتات في مرحلة الشتلات، فيسبب التقزم الشديد للأوراق الصغيرة والأفرع، مما يؤدى إلى نمو كثيف إلى حد ما للنبات. في النباتات القديمة، فإن العدوى تنتج تفريعا ًمفرطاً، وسماكة للأوراق وتجعد، كما أنها تسبب موتاً للعروق واضحاً على نصل الورقة. في مراحل لاحقة من المرض، فإنها تأخذ الملمس الجلدي و هوامشها الميتة تلتف لأعلى وللداخل. إذا وقعت العدوى قبل مرحلة الإزهار، فتنخفض كمية الثمار بصورة كبيرة، وذلك على الرغم من عدم وجود أعراض ملحوظة على سطحها";
        $disease1->chemical_cure = "يمكنك استخدام المبيدات الحشرية مثل عائلة البيرثرويدات عن طريق رشها في خنادق في التربة أو رشها خلال مرحلة نمو البادرات ، والذي يمكن بدوره أن يقلل من عدد الحشرات . و ومع ذلك ، فإن استخدام المبيدات بشكل كبير قد يعزز المقاومة في مستعمرات الذبابة البيضاء . بمجرد الإصابة بالفيروس ، لا توجد علاجات ضد هذه الإصابة . مكافحة أعداد الذباب الأبيض تمكنك من تجنب الإصابة بهذا الفيروس .";
        $disease1->organic_cure = "لا يوجد علاج ضد فيروس تجعد واصفرار أوراق الطماطم . مكافحة أعداد الذباب الأبيض تمكنك من تجنب الإصابة بهذا الفيروس .";
        $disease1->recommendations = "نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت";
        $disease1->protection = "• يجب استخدام أصناف مقاومة للمرض .  \r\n• يمكنك الزراعة في وقت مبكر لتجنب ذروة انتشار الذبابة البيضاء .  \r\n• يمكنك التنويع بزراعة أشوار من النباتات غير المعرضة لأضرار الذبابة البيضاء مثل الكوسة والخيار . \r\n • \r\n• استخدام الشباك لتغطية مهد البذور .  \r\n• ويجب عليك أيضاً تجنب زراعة المضيفات البديلة بالقرب من الطماطم .  \r\n• كما يجب تغطية مهد البذور أو الحقل بالنشارة العضوية لكسر دورة حياة الذبابة البيضاء .  \r\n• واستخدام الفخاخ البلاستيكية الصفراء اللاصقة .  \r\n• وكذلك مراقبة الحقل والتقاط النباتات المصابة يدوياً ، والتخلص منها ودفنها .  \r\n• والبحث عن الأعشاب الضارة في الحقل وحوله والتخلص منها .  \r\n• وكذلك حرث بقايا النباتات عميقاً بعد الحصاد أو حرقها .  \r\n• كما يمكنك ممارسة التناوب الزراعي مع محاصيل غير معرضة للإصابة بأضرار الذبابة البيضاء .";
        $disease1->reason = "إن فيروس تجعد واصفرار أوراق الطماطم لا ينتقل عبر البذور ولا ينتقل ميكانيكياً. ينتشر هذا المرض من قبل الذباب الأبيض من صنف بيميسيا تاباسي. وتتغذى الذبابة البيضاء على سطح الورقة السفلى لعدد من النباتات، كما أنها تنجذب إلى النباتات الصغيرة. يمكن للعدوى أن تحدث وتتم دورتها الكاملة في حوالي 24 ساعة، ويعتبر الطقس الجاف ودرجات الحرارة المرتفعة ظروفاً مناسبة لانتشار الذبابة والمرض.";
        $disease1->type = "فيروسات";
        $disease1->image = "d1.png";
        $disease1->save();
        


        $disease2 = Disease::create();
        $disease2->name = "اللفحة المبكرة";
        $disease2->description = "• الاسم العلمي : r\n Alternaria solani •يوجد كذلك في : الفليفلة والفلفل الحار , الباذنجان , البطاطا ";
        $disease2->symptoms = "• تظهر أولى أعراض المرض على هيئة بقع داكنة مع نمو متحد المركز وهالات صفراء على الأوراق .\r\n • متبوع بجفاف الأوراق وتساقطها .\r\n • الثمار قد تبدأ بالتعفن ثم تسقط في نهاية الأمر . تحدث أعراض اللفحة المبكرة على أوراق الشجر القديمة ، والسيقان ، والثمار . تظهر بقع ذات لون رمادي مائل إلى البني على أوراق الشجر ، وتنمو تدريجياً بطريقة مركزية حول مركز واضح- مما يشكل المظهر المميز الذي يشبه \" هدف الرماية \" . تكون هذه البقع محاطة بهالة صفراء زاهية . ومع تقدم المرض ، قد تتحول الأوراق بأكملها إلى اللون الأصفر الناجم عن نقص الكلوروفيل وتتساقط ، مما يؤدي إلى تساقط الأوراق بشكل ملحوظ . وعندما تموت الأوراق وتسقط ، تصبح الثمار أكثر عرضة لحروق الشمس . ويظهر نفس النوع من البقع ذات المركز الواضح على السيقان والفواكه . ويبدأ تعفن الفواكه وقد تتساقط في النهاية .";
        $disease2->chemical_cure = "عليك النظر دائماً نحو تطبيق نهج متكامل من التدابير الوقائية والعلاجات البيولوجية إذا كانت متوفرة . هناك العديد من المبيدات الفطرية في السوق لمكافحة اللفحة المبكرة . ويمكن استخدام مبيدات الفطريات القائمة على أو التي تحتوي مزيج من الأزوكسيستروبين ، البيرايكلوستيروبين ، الديفينوكونازول ، البوسيكاليد ، الكلوروثالونيل ، الفيناميدون ، المانيب ، المانكوزيب ، التريفلو إكسيس تيروبين ، والزيرام . كما ويوصى بالتنوع والخلط بين المركبات الكيميائية المختلفة . وتطبيق العلاجات في الوقت المحدد مع مراعاة الظروف الجوية . تحقق بعناية من الوقت المسموح فيه بالرش قبل الحصاد ، بحيث يمكنك الحصاد بأمان بعد تطبيق هذه المنتجات .";
        $disease2->organic_cure = " كما وأن تطبيق المنتجات التي تحتوي على البكتيريا العصوية المسببة لأمراض الفطريات أو مبيدات الفطريات القائمة على النحاس المسجلة كمبيدات عضوية يعالج هذا المرض . ";
        $disease2->recommendations = "نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت . ";
        $disease2->protection = "• يجب عليك استخدام بذور معتمدة أو خالية من مسببات الأمراض .\r\n• والبحث عن الأصناف المقاومة للمرض . \r\n• يجب زراعة البذور أو الشتلات على مهاد مرتفع ومحروث لتحسين الصرف . \r\n• وتأكد من توجيه الصفوف في اتجاه الرياح الرئيسية وتجنب المناطق المظللة . \r\n• وحافظ على مساحة مناسبة بين النباتات للسماح للمظلة الخضرية أن تجف بسرعة بعد هطول الأمطار أو الري . \r\n• كما يجب وضع المهاد على التربة لمنع النباتات من لمس التربة . \r\n• وكذلك مراقبة الحقول بحثا عن علامات المرض ، خاصة أثناء الطقس الرطب . \r\n• وإزالة الأوراق السفلية القريبة جدا من التربة . \r\n• وإزالة الأوراق التي تمت ملاحظة الأعراض عليها وتدميرها . \r\n• وكذلك الحفاظ على النباتات قوية ومخضرة بإضافة ما يكفي من المغذيات . \r\n• وكذلك استخدام العصي الخشبية للحفاظ على النباتات منتصبة ومستقيمة . \r\n• استخدام نظام الري بالتنقيط للحد من بلل الأوراق . \r\n• وقم بالري في الصباح حتى تحافظ على النباتات جافة خلال النهار . \r\n• وقم أيضاً بمكافحة الحشائش القابلة للإصابة في الحقل ومن حوله . \r\n• وتجنب العمل في الحقول عندما تكون النباتات رطبة .";
        $disease2->reason = "تنجم الأعراض عن فطر ألترناريا سولاني ، وهي فطريات تعيش على بقايا المحاصيل المصابة في التربة أو على العوائل البديلة . كما قد تكون البذور المشتراة أو الشتلات ملوثة بالفعل . وغالبا ما تصاب الأوراق السفلي عند ملامستها للتربة الملوثة . وتعد درجات الحرارة الدافئة ( 24-29 درجة مئوية ) والرطوبة العالية ( 90 % ) ظروفاً مواتية لتطور المرض . ولذلك تعمل الفترات الرطبة الطويلة ( أو الطقس الرطب / الجاف بالتناوب ) على تحسين إنتاج الأبواغ الفطرية ، والتي قد تنتشر عن طريق الرياح أو تناثر قطرات المطر أو الري العلوي . تكون الثمار التي يتم حصادها ولونها أخضر أو في الظروف الرطبة معرضة بشكل خاص للعدوى . وغالباً ما ينتشر المرض بشدة بعد فترة من الأمطار الغزيرة ، ويعد من الأمراض المدمرة خصوصاً في المناطق الاستوائية وشبه الاستوائية .";
        $disease2->type = "الفطريات";
        $disease2->image = "d2.png";
        $disease2->save();

        $disease3 = Disease::create();
        $disease3->name = "المن";
        $disease3->description = "• الاسم العلمي : Aphis  ي \r\n• يوجد كذلك في : التفاح , الإجاص , العنب , الفاصولياء , الفليفلة والفلفل الحار , الباذنجان , الكرز , المشمش , الخوخ , البسلة , الخيار , اليقطين , الكوسة , الكرنب , البطاطا , اللوبيا الخضراء والسوداء , البسلة الهندية والبسلة الحمراء , البازيلاء والحمص , القطن , قمح , فول الصويا , البصل , الثوم , الأرز , الدخن , اللوز , الذرة الرفيعة , الذرة , الفراولة , الكشمش , الزيتون , الموز , البطاطا الحلوة , البامية , الحمضيات ( الموالح ) , الفول السوداني , المانجو , البابايا , البفرة , قصب السكر , الشعير , القهوة , البطيخ , الرمان , کانولا , عدس , القرنبيط , نباتات الزينة , الكركم , الزنجبيل , الكريلا ( القثاء المر ) , التبغ .";
        $disease3->symptoms = ". يتميز النبات بتجعد الأوراق والأفرع . \r\n• ذبول واصفرار الأوراق والأفرع \r\n• توقف النمو \r\n \r\n الأعداد المنخفضة والمتوسطة ليس لها تأثير ضار على النبات . الإصابات البالغة قد تسبب التفاف الأوراق والتواء الأفرع ، وأحيانا الاصفرار والذبول والنمو الضعيف . ستلاحظ نقص عام في ازدهار المحصول . ينتج المن الندوة العسلية التي قد تشجع عدوى إضافية من نمو الفطريات الانتهازية ، والتي تظهر من خلال نمو الأعفان على سطح النبات ( العفن الهبابي ) . الندوة العسلية تجتذب النمل . يستطيع المن -حتى الأعداد القليلة منه- نقل الامراض الفيروسية من نبات لآخر . الظروف الأكثر ملائمة لتكاثر المن وانتشاره هي الأجواء الدافئة الجافة . ";
        $disease3->chemical_cure = "يجب اتباع إجراءات وقائية متكاملة مع استخدام المكافحة الحيوية إن وجدت . كن حذراً من استعمال المبيدات الحشرية الكيميائية لأنها قد تسبب مقاومة حشرة المن للمبيدات التي استخدمتها . خطط لاستخدام الفلونيكاميد والماء على الجذع بنسبة 1:20 عند أيام 30 ، 45 ، 60 بعد البذر . يمكنك أيضاً استخدام فبرونيل 2 مل أو الثياميثوكزام 0.2 جرام أو فلونيكاميد 0.3 جرام أو أسيتاميبريد 0.2 جرام ( لكل لتر من الماء ) .";
        $disease3->organic_cure = "في حالة الإصابات المتوسطة ، يمكن استخدام محلول صابون مبيد للحشرات أو المحاليل المحتوية على الزيوت النباتية مثل زيت الجرود ( 3 ملالتر ) . يمكن أيضاً للعديد من الفطريات أن تصيب المن وتقتلها إذا توافرت الظروف الرطبة المناسبة . رش المياه على النباتات المصابة قد يحقق نتائج جيدة أيضاً ويزيل مستعمرات المن .";
        $disease3->recommendations = "نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت . ";
        $disease3->protection = "• إبقاء أعداد متنوعة من الأجناس النباتية المختلفة حول الحقول .\r\n • التخلص من بقايا المحصول السابق .\r\n • يمكن استخدام الأغطية البلاستيكة العاكسة على التربة لإبعاد المن عن الحقل . \r\n• راقب الحقل بانتظام للاكتشاف المبكر لأي أعراض أو آفات وتحديد درجة الخطورة . \r\n• قم بقطف اليرقات يدوياً من النبات أو تخلص من الأجزاء المصابة في النبات . \r\n• يجب تفحص الحشائش حول الحقول لاحتمال تواجد مستعمرات المن بها . يجب تجنب الري الزائد والتسميد المفرط . \r\n• مكافحة النمل قد يحقق نتائج جيدة في القضاء على المن ، لأن النمل يحمى المن وينقله من مكان لآخر . \r\n• قلم فروع أشجارك أو تخلص من الأوراق السفلية على نباتاتك لتحسين تهوية النبات .\r\n• إذا استلزم الامر ، يمكن استخدام الشبكات الواقية لإبعاد المن . \r\n• تحكم في استخدام المبيدات الحشرية لكي لا تؤثر على الحشرات النافعة . \r\n• يجب إزالة الأوراق والأفرع والنباتات التي تظهر عليها إصابات كبيرة بالمن والتخلص منها . ";
        $disease3->reason = "المن هي حشرات صغيرة ذات أجساد طرية وأرجل وقرون استشعار طويلة . أحجامها تتراوح بين 0.5 الى 2 مم ولونها قد يكون أصفر أو بني أو أحمر أو أسود حسب النوع الحشرى . قد تظهر الحشرة بدون أجنحة ( وهي الأشكال الأكثر انتشارا ) أو تظهر الافراد المجنحة ذات المظهر الشمعي أو المشعر . غالباً ما تبقى مستعمرات المن كبيرة تتغذى كمجموعات كبيرة على الأسطح السفلية للأفرع الصغيرة أو أطراف الأفرع . تستخدم تلك الحشرات أجزاء الفم الثاقبة الماصة الطويلة أجل امتصاص العصارة من الأنسجة اللينة للنبات . الأعداد القليلة أو المتوسطة لن تحدث ضرراً للنبات . بعد الإصابات الأولية في أواخر الربيع أو بداية الصيف ، تبدأ الأعداد في الانخفاض بصورة طبيعية حتی الاختفاء بسبب الأعداء الطبيعين . العديد من أنواع المن تحمل الفيروسات التي تسبب الأمراض للنباتات .";
        $disease3->type = "الحشرات";
        $disease3->image = "d3.png";
        $disease3->save();


        $disease4 = Disease::create();
        $disease4->name = "تعفن أوراق الطماطم";
        $disease4->description = "الاسم العلمي Mycovellosiella fulva";
        $disease4->symptoms ="• تظهر أعراض المرض على شكل بقع منتشرة باللون الأخضر الباهت أو المصفر على الجانب العلوي من الأوراق .\r\n • وبقع خضراء زيتونية إلى رمادية مائلة إلى اللون الأرجواني على الجانب السفلي . وعند تقدم المرض تصبح المساحات المصابة أكبر ثم تصبح مصفرة ( نقص الكلوروفيل ) أو نخرية وما تلبث حتى تجف تنكمش . تحدث الأعراض عادة على كلا جانبي أوراق الشجر وأحيانا على الفاكهة . تصاب الأوراق القديمة أولاً ثم يتحرك المرض ببطء نحو الأوراق الشابة . تظهر بقع صغيرة منتشرة ذات لون أخضر فاتح أو أصفر وتكون أطرافها غير منتظمة وتظهر على سطح الورقة العلوي . أما على الجانب السفلي ، فتظهر بقع ذات لون أخضر زيتوني إلى أرجواني مخملي وبقع مخملية . وتتألف هذه الهياكل من البويغات المنتجة للجراثيم والكتل البويغية . مع مرور الوقت وتوسع البقع يتغير لون الورقة المصابة من المصفر ( المصاب بنقص الكلوروفيل ) إلى البني ( النخري ) وتبدأ الورقة بالتجعد وتجف . مما سيؤدي إلى تساقط الأوراق قبل أوانها ، مما يؤدي إلى تعري الأوراق في الحالات الشديدة . أما في بعض الأحيان ، فيسبب هذا الكائن الممرض المرض للأزهار أو الثمار مع أعراض مختلفة . قد تتحول البراعم إلى اللون الأسود وتموت قبل تمخض الفاكهة من الزهرة . أما الثمار الخضراء والناضجة فسيبدو عليها مناطق سوداء غير منتظمة وناعمة على طرف الفاكهة الموصول بالساق . مع تقدم المرض ، تصبح المنطقة المصابة غائرة وجافة وذات ملمس جلدي .";
        $disease4->chemical_cure ="عليك دائما النظر نحو امكانية تطبيق نهج متكامل من التدابير الوقائية جنبا إلى جنب مع العلاجات البيولوجية إذا كان ذلك متاحاً . يجب إجراء الرش والمعالجة قبل الإصابة عندما تكون الظروف البيئية مثالية لتطور المرض . والمركبات الموصى بها في الاستخدام في الحقول المفتوحة هي مركبات الكلوروثالونيل ، والمونيب و والمانكوزب والنحاس . أما بالنسبة للبيوت الزجاجية ، فينصح باستخدام مبيد دايفينوكونازول أو المانديبروباميد أو السايموكسانيل أو فاموكسادون أو سيبرودينيل .";
        $disease4->organic_cure ="ينصح بعلاج البذور بالماء الساخن ( 25 دقيقة عند 122 درجة فهرنهايت أو 50 درجة مئوية ) لتجنب نمو العامل الممرض على البذور . أما الفطر أكريمونيوم ستريكتوم ، أو دايسيما بولفيناتا ، أو تريتشوديرما هارزیانوم أو تريتشوديرما فيردي و تريتشونيسيوم روزيوم هما معاديان للفطر الممرض ويمكن استخدامه لتقليل انتشاره . أما في تجارب الدفيئات الزراعية فتم تثبيط نمو الفطر الممرض على الطماطم بواسطة سلالة 3 من أكريمونيوم ستريكتوم تريتشوديرما فيردي ، و تریتشوثیسیوم روزيوم بنسبة 53 و 66 و 84 % على التوالي . كما ويمكن رش التعفن باستخدام خل التفاح المخمر ، أو الثوم أو الحليب ومزيج الخل لمعالجته .";
        $disease4->recommendations ="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما المرض ، يرجى استخدام المكافحة الكيميائية . من لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت .";
        $disease4->protection = "• عليك الحصول على البذور من مصادر معتمدة خالية من الأمراض . \r\n • كما ويستحسن أن تقوم بالزراعة في وقت مبكر للحد من المرض . شدة • ضبط تباعد الصفوف والنباتات لتعزيز دوران الهواء وتقليل الرطوبة تحت الغطاء النباتي ( المظلة ) .  \r\n• كما ويجب زراعة الأصناف المقاومة أو المتحملة إذا كانت متوفرة منطقتك .  \r\n• مراقبة الحقل والتخلص من النباتات المصابة بمجرد الكشف عنها .\r\n • تجنب التسميد النيتروجيني المفرط .\r\n . وقم بتعزيز دوران الهواء داخل الحمام الزراعي ( البيت البلاستيكي .\r\n • كما ويجب الحفاظ على الرطوبة النسبية أقل من 85 ٪ ودرجات حرارة الليل أعلى من درجات الحرارة في خارج البيت البلاستيكي ( مناسبة للبيوت البلاستيكية ) . \r\n•  استخدام الري بالتنقيط وتجنب ري أوراق الشجر .\r\n • استخدم العصي ، أو الحبال ، أو قم بتقليم النبات للحفاظ على وقوفه لزيادة تدفق الهواء فيه ومن حوله .\r\n• إزالة وتدمير ( حرق ) جميع المخلفات النباتية بعد الحصاد . \r\n• تعقيم البيوت البلاستيكية بين المحاصيل والحفاظ على معايير النظافة واسعة النطاق مع الأدوات وبين العمال .";
        $disease4->reason ="تحدث الأعراض بسبب الفطر فولفيا فالفا ، الذي يمكن أن تعيش جراثيمه بدون مضيف لمدة 6 أشهر إلى سنة عند درجة حرارة الغرفة ( ليس إلزاميا ) . أما الجراثيم فتفضل رطوبة الأوراق لفترات طويلة والرطوبة فوق 85 ٪ . يجب أن تكون درجة الحرارة بين 4 إلى 34 درجة مئوية لكي تتكاثر الجراثيم ، وتعتبر درجة الحرارة المثالية للنمو بين 24-26 درجة مئوية . أما الظروف الجافة وغياب الماء عن الأوراق فيضعف تكاثرها . عادة ما تبدأ الأعراض بالظهور بعد 10 أيام من التلقيح مع تطور البقع على جانبي الورقة . فعلى الجانب السفلي يتشكل عدد كبير من البني المنتجة للابواغ ويتم انتشار هذه الأبواغ بسهولة من النبات إلى آخر بواسطة الرياح وتناثر المياه ، وكذلك التنقل على الأدوات وملابس العاملين وبواسطة الحشرات . يصيب العامل الممرض الورقة عن طريق اختراق المسامات في خلال فترات الرطوبة المرتفعة .";
        $disease4->type = "الفطريات";
        $disease4->image = "d2.png";
        $disease4->save();

        $disease5 = Disease::create();
        $disease5->name = "التبقع السبتوري للأوراق";
        $disease5->description = "الاسم العلمي Septorial lycopersici";
        $disease5->symptoms ="• تظهر أعراض المرض على شكل بقع دائرية صغيرة رمادية ذات حواف بنية داكنة اللون على الجهة السفلية من الأوراق القديمة .\r\n • كما وتظهر نقاط سوداء في مراكزها .\r\n • ثم يظهر إصفرار طفيف على الأوراق ، ومن ثم تذبل وتتساقط . تنتشر الأعراض من أجزاء النباتات القديمة إلى الأجزاء حديثة النمو بشكل تصاعدي . كما وتظهر بقع دائرية صغيرة مبللة ذات لون رمادي مع هوامش بنية داكنة على الجهة السفلي من الأوراق القديمة . أما في مراحل متقدمة من هذا المرض ، تكبر البقع وتتداخل ، و تظهر نقط سوداء في مراكزها . يمكن ملاحضة نفس الأعراض على الجذوع و الأزهار ، و نادراً على الفواكه . الأوراق المصابة بشدة قد تصفر قليلاً ثم و تذبل وتتساقط . قد يؤدي إنحلال الأوراق إلى جفاف الفواكه .";
        $disease5->chemical_cure="يجب رش النبات بمبيد ال copper oxychloride 50.0wp";
         $disease5->organic_cure ="قد تساعد مبيدات الفطريات المكونة من النحاس ، مثل خلیط بوردو ، أو هيدروكسيد النحاس ، أو كبريتات النحاس ، أو كبريتات أوكسي كلوريد النحاس على السيطرة على مسببات الأمراض .";
        $disease5->recommendations ="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما المرض ، يرجى استخدام المكافحة الكيميائية . من لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت .";
        $disease5->protection="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما ، المرض ، يرجى استخدام المكافحة الكيميائية . من لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت .";
         $disease5->reason ="يحدث التبقع السبتوري في جميع أنحاء العالم ويسبب هذا المرض فطر سيبتوريا ليكوبيرسيسي . وهو فطر يصيب نباتات البطاطس والطماطم فقط . تتراوح درجة الحرارة المناسبة لنمو الفطر بين 15 و 27 درجة مئوية ، ونمو أمثل عند درجة 25 درجة مئوية . كما وأنه قد تنتشر الجراثيم عن طريق مياه الري ، أو المطر المتطاير أو أيدي وملابس جامعي الفواكه ، أو الحشرات مثل الخنافس ، وكذلك المعدات الزراعية . يعيش الفطر على الأعشاب الباذنجيىة ولفترات قصيرة في التربة أو على مخلفات النبات في التربة .";
        $disease5->type = "الفطريات";
        $disease5->image = "d3.png";
        $disease5->save();


        $disease6 = Disease::create();
        $disease6->name = "العنكبوت (الاكاروس)";
        $disease6->description = " يوجد في التفاح والعنب والفاصوليا و الفليفله والخوخ والباذنجان والخيار والقطن والكوسة وال اليقطين  الاسم العلمي Tetranychidae ";
        $disease6->symptoms ="  ظهور بقع صغيرة جدا على الأوراق . \r\n • قد تظهر خيوط أعشاش العنكبوت بين الجذع والورقة . \r\n • تذبل الأوراق ، وتظهر ممزقة وجافة . \r\n • يكون العث صغير جداً بيضاوي ولونه أخضر باهت . \r\n • تتغذى الاكاروسات على الأوراق مسببة بقغ بيضاء الى صفراء محمرة على السطح العلوي للورقة . كلما اشتدت الإصابات ، تظهر الأوراق لونها برونزي أو فضى أولاً ثم تصبح هشة بتمزق الأنسجة بين العروق وتسقط في النهاية . \r\n • يتواجد بيض عث العنكبوت على السطح السفلى لأوراق . \r\n • يبقى الاكاروس على السطح السفلي للورقة داخل شرنقة تشبة أعشاش العنكبوت . \r\n • يصنع الاكاروس شبكات خيطية تغطى سطح النبات في مواضع كثيرة . \r\n • تتساقط الأوراق من على اطراف الافرع وتبدأ النموات الجانبية في الظهور . \r\n • في الإصابات الشديدة ، تقل الإنتاجية وجودة الثمار .";
        $disease6->chemical_cure="يجب رش بالمبيد الحشري التالي  Abamectin";
        $disease6->organic_cure ="urticae في حالة الإصابات الطفيفة ، يمكن فقط غسل أماكن تواجد الاكاروس عن طريق رش الماء ، وكذلك إزالة الأوراق المصابة . استخدام تحضيرات من زيوت النيم وفول الصويا والريحان والكانولا ( السلجم ) لرش الأوراق بعناية ، حيث يمكنها تقليل أعداد عث العنكبوت .T يمكن أيضاً استخدام مستخلصات الثوم والحريق وقراص الطين ومحاليل الصابون الزراعي للحد من الحشرات . وكذلك يمكن استخدام المفترسات الاكاروسية مثل Phytoseiulus persimilis او المبيدات الحيوية المحتوية على بكتيريا Bacillus thuringiensis . هناك العديد من المنتجات الحيوية المتوافرة .";
        $disease6->recommendations ="بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . نوصي لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت .";
        $disease6->protection="• ازرع الأصناف المقاومة إن أمكن . \r\n • يجب مراقبة حقلك بانتظام وفحص السطح السفلي للأوراق . \r\n • بدلاً عن ذلك ، حرك بعض الحشرات بعيداً عن سطح الورقة على ورقة بيضاء . قم بإزالة الأوراق والنباتات المصابة . \r\n • قم بإزالة الحشائش خاصة حشيشة الحريق من الحقول . \r\n • قم برش الماء على الممرات وأي مناطق ترابية أخرى على فترات منتظمة لتجنب الظروف الترابية في الحقل . \r\n • قم بري محصولك بانتظام لأن الأشجار والنباتات المتعرضة للضغط أقل تحملاً لضرر عث العنكبوت . \r\n • يجب الاهتمام بأنواع المبيدات المستخدمة وعدم المبالغة في الرش التي قد تقضى على الحشرات النافعة .";
        $disease6->reason ="يحدث الضرر بسبب عث العنكبوت من جنس تيترانيكس ، بالأساس نوعي تيترانيكس ارتيكاي وتيترانیکس سیناباریناس الاكاروس الأنثى البالغة لونها أخضر باهت بطول 0.6 مم ، وعلى سطح جسمها البيضاوي تظهر بقعتين داكنتين وشعيرات طويلة على مؤخرة الجسم . الإناث التي تبقى خلال الشتاء يكون لونها محمر . في الربيع ، تضع الإناث بيضاً كرويا شبه شفاف على السطح السفلى للأوراق . الحوريات لونها أخضر باهت وعليها علامات داكنة على الظهر . تحمى الاكاروسات نفسها عن طريق اختبائها داخل شرنقة تصنعها على السطح السفلى للورقة . يفضل الاكاروس الحرارة المرتفعة والظروف الجافة ، وتحت تلك الظروف يستطيع أن ينتج حتى 7 أجيال في السنة الواحدة . يستطيع الاكاروس التغذى على العديد من المضيفات البديلة من بينها الحشائش الضارة ";
        $disease6->type = "الفطريات";
        $disease6->image = "d4.png";
        $disease6->save();

        $disease7 = Disease::create();
        $disease7->name = "اللفحة المتأخرة فى الطماطم";
        $disease7->description ="الاسم العلمي Phytopthora infestans";
         $disease7->symptoms="• تبدو أعراض المرض على شكل بقع ذات لون بني تبدأ . من أطراف الورقة ، ومن ثم تظهر قشور بيضاء تغطى السطح السفلي للورقة ، ومن ثم تظهر تبقعات رمادية أو بنية ذات مظهر متجعد على الثمار .\r\n • مما يؤدي إلى تصلب الثمرة وتعفنها . يمكن التعرف على الإصابة من خلال ظهور بقع ذات لون أخضر مائل للبني ، والتي تظهر على أطراف الورقة وقمتها ، وعند تقدم المرض ، تتحول أجزاء كبيرة من الورقة للون البني تماماً ، وخلال الطقس الرطب ، تظهر تقرحات على أجزاء من سطح الورقة السفلى مع نموات فطرية بيضاء رمادية ، مما يجعل من السهولة تمييز الأنسجة السليمة من الميتة ، ومع تقدم المرض ، يتحول المجموع الخضري بأكمله إلى اللون البني ، وتتجعد الأوراق وتجف . وفي بعض الأحيان ، تظهر تبقعات بنية محددة وتغطيات بيضاء على السيقان والفروع وأعناق الأوراق ، وتظهر أيضاً بقع مجعدة على الثمار بين اللون الأخضر الرمادي واللون البني المتسخ ويكون لب الثمرة جاف ومتصلب عند هذه البقع .";
         $disease7->chemical_cure="يجب رش النبات بمبيد خلال ساعات المساء اسم المبيد Mancozeb";
         $disease7->organic_cure ="لا توجد وسائل مكافحة بيولوجية لها القدرة على مكافحة اللفحة المتأخرة . ولتجنب انتشار المرض ، يجب إزالة النباتات حول المنطقة المصابة والتخلص منها بشكل فوري ، ولا ينصح كذلك باستخدام النباتات المصابة لعمل الأسمدة العضوية .";
           $disease7->recommendations ="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت .";
           $disease7->protection="• عليك شراء البذور السليمة من التجار المعتمدين ، كما وعليك زراعة أصناف أكثر مرونة ، ولا يجب زرع الطماطم والبطاطس على مقربة من بعضهم .\r\n • مع محاولة المحافظة على النباتات جافة من خلال التصريف الجيد للماء والتهوية الجيدة في مزارع الشتلات الخاصة بك . من القماش . قم بتثبيت مأوى مطري شفاف وبسيط بمساعدة قطعة المشمع بمساعدة قطع خشبية ، وكذلك استخدام المقويات النباتية لتقوية النباتات بشكل عام .\r\n • كما يوصى بتدوير المحاصيل من سنتين إلى ثلاث سنوات مع المحاصيل غير المضيفة .\r\n • عليك استخدام الأسمدة التي تحتوي على السيليكات لأنها قد تزيد من مقاومة الفطريات ، خاصة في مرحلة الشتلات ، تجنب الري في وقت متأخر من النهار ، وقم بري النباتات على مستوى الأرض ، عليك تطهير المعدات والآلات المستخدمة في الحقل .";
            $disease7->reason="تزداد احتمالية الإصابة بهذا المرض في وسط أشهر الصيف ، ويدخل مسبب المرض إلى أنسجة النباتات الداخلية من خلال الجروح والشقوق على سطح النبات ، وتعتبر درجات الحرارة والرطوبة هي أهم العوامل البيئة لانتشار المرض ، حيث ينمو الفطر المسبب للفحة الطماطم المتأخرة في مستويات الرطوبة المرتفعة نسبياً ( حوالي % 90 ) ودرجات الحرارة ما بين 18 و 26 درجة مئوية ، ويمكن أن يتوقف انتشار المرض بشكل تام في فترات الصيف ذات درجات الحرارة المرتفعة والطقس الجاف .";
              $disease7->type = "الفطريات";
        $disease7->image = "d5.png";
        $disease7->save();



        //        $disease3 = Disease::create();
        //        $disease3->name="المن";
        //        $disease3->description="";
        //        $disease3->symptoms="";
        //        $disease3->chemical_cure="";
        //        $disease3->organic_cure="";
        //        $disease3->recommendations="خفيفًا.";
        //        $disease3->protection=" ";
        //        $disease3->reason=" ";
        //        $disease3->type="الحشرات";
        //        $disease3->save();



        $disease1->Plants()->attach($plant->id);
        $disease2->Plants()->attach($plant->id);
        $disease3->Plants()->attach($plant->id);
        $disease4->Plants()->attach($plant->id);
        $disease5->Plants()->attach($plant->id);
        $disease6->Plants()->attach($plant->id);
        $disease7->Plants()->attach($plant->id);












        $stage1 = Stage::create([
            'name' => "مرحلة ماقبل الشتلات",
            'plant_id' => 1,
            'interval' => 4,
            'step' => 1,
            'image' =>'s1.png',
            'watering_period'=>3,
        ]);


        $stage2 = Stage::create([
            'name' => "مرحلة الشتلات",
            'plant_id' => 1,
            'interval' => 2,
            'step' => 2,
            'image' =>'s2.png',
            'watering_period'=>3,
        ]);


        $stage3 = Stage::create([
            'name' => "مرحلة النمو",
            'plant_id' => 1,
            'interval' => 7,
            'step' => 3,
            'image' =>'s3.png',
            'watering_period'=>5,
        ]);


        $stage4 = Stage::create([
            'name' => "مرحلة الازهار",
            'plant_id' => 1,
            'interval' => 2,
            'step' => 4,
            'image' =>'s4.png',
            'watering_period'=>5,
        ]);
        $stage5 = Stage::create([
            'name' => "مرحلة الاثمار",
            'plant_id' => 1,
            'interval' => 2,
            'step' => 5,
            'image' =>'s5.png',
            'watering_period'=>5,
        ]);
        $stage6 = Stage::create([
            'name' => "مرحلة الحصاد",
            'plant_id' => 1,
            'interval' => 4,
            'step' => 6,
            'image' =>'s6.png',
            'watering_period'=>4,
        ]);

        $stage7 = Stage::create([
            'name' => "مرحلة مابعد الحصاد",
            'plant_id' => 1,
            'interval' => 2,
            'step' => 7,
            'image' =>'s7.png',
            'watering_period'=>0,
        ]);

        $disease1->Stages()->attach($stage6->id);
        $disease1->Stages()->attach($stage3->id);
        $disease2->Stages()->attach($stage3->id);
        $disease2->Stages()->attach($stage4->id);
        $disease3->Stages()->attach($stage4->id);
        $disease3->Stages()->attach($stage3->id);
        $disease3->Stages()->attach($stage2->id);

        $disease4->Stages()->attach($stage4->id);
        $disease4->Stages()->attach($stage5->id);

        $disease5->Stages()->attach($stage5->id);
        $disease5->Stages()->attach($stage4->id);
        $disease5->Stages()->attach($stage3->id);



        $disease6->Stages()->attach($stage3->id);
        $disease6->Stages()->attach($stage4->id);


        $disease7->Stages()->attach($stage5->id);
        $disease7->Stages()->attach($stage6->id);

        $plantSchedule1 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "اختيار النبات",
            'image'=>"selectPlant.png",
        ]);

        $plantSchedule2 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "الزراعة",
            'image'=>"farmer.png",
        ]);
        $plantSchedule3 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "العناية بالنبات",
            'image'=>"training.png",
        ]);
        $plantSchedule4 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "المراقبة",
            'image'=>"monitoring.png",
        ]);
        $plantSchedule5 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "اختيار الموقع",
            'image'=>"siteSelectoin.png",
        ]);
        $plantSchedule6 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "تجهيز الحقل",
            'image'=>"fieldPreparation.png",
        ]);

        $plantSchedule7 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "ازالة الاعشاب الضارة",
            'image'=>"weeding.png",
        ]);
        $plantSchedule8 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "الري",
            'image'=>"lrrigation.png",
        ]);

        $plantSchedule9 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "التسميد العضوي",
            'image'=>"organic.png",
        ]);

        $plantSchedule10 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "التسميد الكيميائي",
            'image'=>"chemical.png",
        ]);
        $plantSchedule11 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "اجراء وقائي",
            'image'=>"preventive.png",
        ]);
        $plantSchedule12 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "حماية النباتات: كيميائية",
            'image'=>"protection.png",
        ]);
        $plantSchedule13 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "حماية النباتات: عضوية",
            'image'=>"protection2.png",
        ]);
        $plantSchedule14 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "خلال الحصاد",
            'image'=>"harvesting.png",
        ]);
        $plantSchedule15 = PlantSchedule::create([
            'plant_id' => 1,
            'title' => "بعد الحصاد",
            'image'=>"postHarvest.png",
        ]);



        /////////////////////////////stages/////////////
        $step1 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 1,
            'interval' => 1,
            'image'=>"siteSelection.png",
            'description' => "توفر التربة الدعم الميكانيكي والمواد المغذية والماء لنمو النبات فيما يلي بعض خصائص التربة المثالية لنمو الخضروات :يتكيف نمو نباتات الطماطم مع التربة الطينية جيدة التصريف، مع درجة الحموضة الحمضية قليلاً بين 6 و 6.8. يجب أن تبقى مناطق الجذور رطبة، لكن ليست رطبة جداً. قد تنمو جذور الطماطم على عمق 3 أمتار في أفضل الظروف، لذلك فإنه من المهم أن تكون التربة رخوة ويمكن للمياه أن تجري بحرية. قد تؤدي الأحواض الصلبة والتربة الطينية الثقيلة إلى تقييد النمو في منطقة الجذر وتسبب نمو النباتات غير الصحية التي تؤدي إلى إعاقة النمو وانخفاض الانتاجية.",
            'title' => "التربة والظروف الجوية المثالية لمحصول الخضار في حقلك",
        ]);

        $step2 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 2,
            'image'=>"fertilizationChemical.png",
            'description' => "فيما يلي تفاصيل مرات التخصيب هذه وتوقيتاتها:\r\n* تطبيق 8-10 طن لكل فدان من السماد الحيواني أثناء إعداد الحقل.\r\n* تطبيق 42 كجم لكل فدان من اليوريا، و 52 كجم لكل فدان من الديامونيوم فوسفات DAP و 33 كجم لكل فدان من موريات البوتاس MOP قبل 2 أو 3 أيام من الزراعة.\r\n* ضع 20 كجم لكل فدان من اليوريا بعد 25-35 يومًا من الزرع أثناء مرحلة تكوين الزهور. وهذا هو التطبيق الانقسامي الأول.\r\n* ضع 20 كجم لكل فدان من اليوريا بعد 35-45 يوماً من الزرع، خلال مرحلة نمو مجموعات الثمار. وهذا هو التطبيق الانقسامي الثاني.\r\nخلال تطبيق الجزء الثاني من التطبيق الانقسامي، يمكنك إضافة المغذيات الدقيقة:\r\n* الرش الورقي الذي يحتوي على البورون، على سبيل المثال باستخدام البوراكس (4 جم/ لتر). \r\n* في التربة التي تعاني من نقص الزنك، رش كبريتات الزنك على سبيل المثال بواقع 5 جم/ لتر).\r\n* اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك.",
            'title' => "التسميد المتوازن لمحصول الطماطم",
        ]);

        $step3 = Step::create([
            'plant_schedule_id' => 1,
            'stage_id' => 1,
            'image'=>"plantSelection.png",
            'interval' => 2,
            'description' => "",
            'title' => "early and late varieties",
        ]);

        $step4 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 1,
            'image'=>"fieldPreparation1.png",
            'interval' => 2,
            'description' => "يقلل الحرث الكافي من حجم حبيبات التربة ويفكك التكتلات الصلبة مما يزيد من فرص ملامسة التربة للبذور وتطوير الجذر بشكل افضل احرث الارض مع تقبيب التربة ثم افرم التربه 3-5 مرات للحصول على تربة مفككه ",
            'title' => "حراثة التربة واعداد الأخاديد لتحسين التربة",
        ]);

        $step5 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 3,
            'image'=>"chim.png",
            'description' => "يضيف السماد الحيواني المواد العضوية إلى التربة، مما يساعد على الاحتفاظ بالمياه والمواد الغذائية. تعتمد كمية الأسمدة المعدنية إلى حد كبير على عوامل مثل نوع المحصول؛ طبيعي أو هجين، والوصول إلى الري، ونوع التربة. إليك بعض التوصيات: \r\n* أضف السماد الحيواني (8-10 طن لكل فدان) إلى التربة خلال عملية الحراثة والتسوية الأخيرة. \r\n* من حيث النسب، يتم إضافة نصف الكمية الإجمالية من النيتروجين N و البوتاسيوم K والكمية الكاملة من الفوسفور P. \r\n* وهذا يصل عملياً إلى 42 كجم لكل فدان من اليوريا، و 52 كجم لكل فدان من الديامونيوم فوسفات DAP، و 33 كجم لكل هكتار من موريات البوتاس MOP.\r\n* اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك.",
            'title' => "تطبيق التسميد القاعدي اثناء اعداد الحقل",
        ]);
        $step6 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 1,
            'interval' => 3,
            'image'=>"chim.png",
            'description' => " تأكد من خلط هذة المنتجات جيدا مع التربة مع اذافة السماد العضوي أثناء تحضير الحقل \r\n.الترايكوديرما فيردي wp %1.5 بواقع 2كجم لكل فدان \r\n.يتم استخدام كعكه النيم بمعدل 1كجم لكل 2-3 متر مربع",
            'title' => "عالج التربة اذا لزم الأمر لنمو محاصيل صحية",
        ]);

        $step7 = Step::create([
            'plant_schedule_id' => 9,
            'stage_id' => 1,
            'interval' => 3,
            'image'=>"chim.png",
            'description' => "خلال الشهر الأول ، تحتاج الشتلات إلى الكثير من العناصر الغذائية . ولا يعتبر السماد الحيواني مصدرا للمغذيات فحسب ، ولكنه يحتوي أيضا على ثروة من المواد العضوية والمياه ، مما يساعد في الحفاظ على بنية التربة الجيدة للصرف والتهوية . إليك بعض التوصيات : \r\n *يجب إضافة السماد الحيواني أو السماد العضوي المتحلل بالكامل إلى التربة بعد الحراثة الأخيرة وقبل تخطيط الصفوف ( الأخاديد ) . \r\n• الكميات الموصى بها تختلف باختلاف المحصول ، ولكنها عادة ما تكون في حدود 8-10 طن / فدان . تأكد من خلط السماد جيداً بالتربة وإيصاله إلى العمق المناسب . السماد \r\n• اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن الحيواني الذي يناسب أغراضك والكمية المحددة الذي توافق حالتك .",
            'title' => "اضافة السماد الحيواني خلال الحرث لدعم النباتات",
        ]);
        $step8 = Step::create([
            'plant_schedule_id' => 13,
            'stage_id' => 1,
            'interval' => 4,
            'image'=>"mo.png",
            'description' => "يمكن معالجة البذور قبل 24 ساعة من البذر بمساحيق أو محاليل مضادة للميكروبات أو مبيدات الفطريات ، على سبيل المثال مع الترايكوديرما فيريدي ( 4-10 جم / كجم بذور ) ، أو البكتيريا الزائفة المتألقة ( 10 جم / كجم بذور ) أو الأزوسبيريلوم ( 4 جم / كجم بذور ) . ثم تجفيف البذور المعالجة خلال فترة الليل في مكان محمي ، لثزرع في اليوم التالي . من المهم ضبط العلاج مع الخضروات المعنية حتى يتأثر بقاء البذور وإنباتها . أخيرا ، إذا كانت البذور التي تنوي زراعتها قد تمت معالجتها بأحد هذه المنتجات من قبل ، فليس من الضروري معالجة البذور مرة أخرى . اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن كون أي من الطرق المذكورة يناسب أغراضك .",
            'title' => "علاج البذور عن طريق الأساليب البيولوجية قبل البذر",
        ]);

        $step9 = Step::create([
            'plant_schedule_id' => 12,
            'stage_id' => 1,
            'image'=>"mo2.png",

            'interval' => 4,
            'description' => "من الجدير بالذكر أن العديد من البذور التي يحصل عليها المزارعون قد تمت معالجتها مسبقاً لتجنب سلسلة من الأمراض . إذا لم يكن الأمر كذلك ، يمكنك معالجة بذور العديد من المحاصيل النباتية أو \" تغليفها \" بالمنتجات الكيميائية التالية لحمايتها من الأمراض والآفات . إليك بعض التوصيات : \r\n • لمكافحة الأمراض الفطرية : يمكن تطبيق المحاليل التي تحتوي على الثيرام أو الكابتان أو المانكوزب ( 2.5 جم / كجم من البذور ) ، وهذا من شأنه أن يوفر الحماية لمدة تصل إلى 3 أسابيع . \r\n • ضد الحشرات الماصة : سيحمي الإماكلوبريد 600 FS بواقع ( 5 مل / كلغ من البذور ) أو الثيوميثوكسام 70 WS بواقع ( 5 جم / كجم من البذور ) البذور لمدة تصل إلى 20 يوما بعد البذر . \r\n • في جميع الحالات ، يجب ترك البذور حتى تجف في الظل لحوالي 30 دقيقة إلى ساعة بعد العلاج . \r\n • اسأل مسؤول الإرشاد الزراعي أو تاجر التجزئة المحلي عن العلاجات الأنسب لأغراضك .",
            'title' => "المعالجات الكيميائية للبذور لتعزيز بقاء الشتلات",
        ]);

        $step10 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 1,
            'interval' => 4,
            'image'=>"g1.png",
            'description' => "هناك طريقة ذكية لتخليص قاع البذر من الحشائش المحتملة ، وهي تحضير التربة كالمعتاد ثم : تأخير البذار حتى ظهور الحشائش الأولى . يمكن بعد ذلك قتل هذه الموجة الأولى من الأعشاب الضارة عن طريق الإثارة السطحية للتربة . يجب أن تكون الإثارة سطحية لتجنب جلب بذور الحشائش المدفونة إلى السطح . لكي تنجح هذه الطريقة ، من المهم أن تكون التربة رطبة ودافئة بدرجة كافية لتشجيع الأعشاب الضارة على الإنبات . بمجرد تنظيف سطح التربة ، يمكن زرع بذور المحاصيل التي تهمك . بعد ذلك ، حافظ على القيعان خالية من الأعشاب حتى الزراعة ، عن طريق إزالة الأعشاب الضارة يدويا .",
            'title' => "اتأكد من الحصول على قيعان بذر خالية من الأعشاب الضارة",
        ]);
        $step11 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 4,
            'image'=>"g2.png",
            'description' => "إلى جانب إضافة السماد الحيواني إلى تربة البذر ( 2-4 كغم / م 2 من الحاضنات ) لتحسين بنيتها ومحتواها العضوي ، يوصى بتوفير المغذيات للشتلات لمنحها بداية قوية وتقويتها لباقي الموسم . بعد حوالي 7-10 أيام من تقليم الشتلات ، إذا كانت الأوراق تتحول إلى لون أخضر مصفر وباهت ، أضف أحد المنتجات أدناه إلى تربة البذر : \r\n • النيتروجين : 40 جم / متر مربع على هيئة كبريتات الأمونيوم أو محلول اليوريا بتركيز 0.25 ٪ ( 2.5 جم / لتر ) \r\n• الفوسفور : 50 جم / متر مربع على هيئة سوبر فوسفات \r\n • البوتاسيوم : 30 جم / متر مربع على هيئة كلوريد بوتاسيوم  \r\n• تحدث إلى جيرانك والمستشار الزراعي وممثلي شركة الأسمدة وتجار التجزئة لفهم الجرعات التي تناسب أغراضك .",
            'title' => "خصب حاضنات البذور لبدء انطلاق النباتات بصحة جيدة",
        ]);

        $step12 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 2,
            'interval' => 1,
            'image'=>"g3.png",
            'description' => "ان بذر البذور في قيعان البذور مع التربة المخصبة يتيح لك الحصول إن بذر البذور في قيعان البذور مع التربة المخصبة يتيح على شتلات قوية لزرعها . واحدة من المشاكل التي قد تحدث من تلف الجذر عندما يتم سحب النباتات من التربة هي أن تعاني الشتلات لزرعها . قد يؤخر ذلك النمو أو يتسبب في موت الشتلات . ممارسات الري الجيدة يمكن أن تساعد في منع هذه المشكلة .",
            'title' => "كيفية زراعة البذور في الحضانة",
        ]);

        $step13 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 2,
            'interval' => 2,
            'image'=>"g4.png",
            'description' => "تشير تقوية الشتلات إلى التعريض التدريجي للشتلات المزروعة في قاع البذر إلى بيئة أكثر قسوة . يزيد هذا من مقاومتها وفرص بقائها على قيد الحياة بعد الزرع . يمكن أن تتم التقوية بطرق مختلفة ، وذلك باستخدام الضوء ، ورفع درجات الحرارة ، أو الامتناع عن الري . \r\n• تعريض الشتلات تدريجياً إلى شدة ضوئية أعلى و / أو درجات حرارة أعلى على مدار فترة تتراوح من 7 إلى 10 أيام قبل الزرع . \r\n• خفض كميات الري أو الامتناع عن الري 4-5 أيام قبل الزرع .",
            'title' => "قم بتقوية الشتلات من لزيادة فرص بقائها على قيد الحياة",
        ]);
        $step14 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 2,
            'interval' => 1,
            'image'=>"g5.png",
            'description' => "يحدث الري الأول مباشرة بعد بذر البذور في قاع البذر ، ويجب أن يكون كبيرا لضمان ملامسة تربة البذور بشكل جيد لزيادة فرص الإنبات . بعد ذلك ، يمكنك الري بشكل أكثر سطحية خلال الأيام الثلاثة أو الخمسة القادمة في الصباح والمساء . حيث تساعد التربة الرطبة على تعزيز الإنبات وإنشاء محصول جيد . إذا كنت تروي جيدا ، فستنبت البذور بعد 5 إلى 7 أيام من الزراعة .",
            'title' => "قم بري حاضنات البذور بالماء من أجل انبات البذور بشكل جيد",
        ]);
        $step14 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 2,
            'interval' => 2,
            'image'=>"g6.png",
            'description' => "يتم التخفيف عادة في غضون 2-3 أيام بعد ظهور الورقة الحقيقية الأولى ، أو بعد حوالي 5-7 أيام من البذر . إليك بعض التوصيات : \r\n•قم بإزالة المهاد الذي وضعته على قاع البذور بعد البذر . \r\n• اسحب الشتلات الضعيفة أو المريضة من التربة . \r\n• تأكد من أن الشتلات المتبقية تتباعد حوالي 5 سم داخل الصف . \r\n• ازرع الشتلات التي قمت بإزالتها في حاويات من التربة . وبعدها يمكن استخدامها لسد الفجوة في الحقل في وقت لاحق من الموسم .\r\n• هذا مهم بشكل خاص عند استخدام بذور باهظة الثمن",
            'title' => "تخفيف الشتلات لتنمو النباتات بشكل صحي"
        ]);

        $step15 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 1,
            'image'=>"g5.png",
            'description' => "ستساعد التربة الرطبة على تعزيز تشكيل الجذور وتعزيز نشأة جيدة للشتلات . فيما يلي بعض التوصيات حول كيفية الشتلات في قيعان البذر : \r\n• الري بشكل كبير لتأمين نشأة جيدة للشتلات . \r\n• الري في الصباح حتى يتسنى للمحاصيل الوصول مباشرة إلى المياه ، والتي يمكن أن تجف خلال النهار . \r\n• قم بالتخطيط للري بعد 10 و 15 و 25 يوماً من البذر لتقوية النباتات . \r\n• إذا اخترت تقوية الشتلات عن طريق تقليل الماء ، فتوقف عن الري في هذه المرحلة . حيث تساعد تقوية الشتلات الخاصة بك على تعودها على الظروف الجوية القاسية الموجودة في الحقول المفتوحة . \r\n• تأكد من الري مرة أخرى في اليوم السابق لنقل الشتلات لتنعيم التربة حول الجذور .",
            'title' => "قم بالري بانتظام من اجل تأمين نشأة جيدة للشتلات"
        ]);

        $step16 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 1,
            'image'=>"g7.png",
            'description' => "فيما يلي بعض التوصيات حول موعد زراعة شتلات الخضروات لتأمين نشأة جيدة للمحصول في الحقل : \r\n• في المناخات الباردة أو في حال الزراعة على ارتفاعات عالية ، لا تتم عملية الزرع إلا بعد الصقيع الأخير في الربيع لتجنب الخسائر . \r\n• يجب أن تكون درجات الحرارة ليلاً ونهاراً فوق 12 درجة مئوية لعدة أيام . \r\n • يجب أن تكون الشتلات ذات عمر ونمو مناسبين . فالشتلات القديمة جدا قد لا تنمو جيدا . \r\n• ازرع في ساعات المساء أو في يوم غائم لتقليل الصدمة الأسموزية للجذور والنبتة من العوامل الخارجية . \r\n• ازرع في أخاديد صغيرة مسطحة أو ضحلة ، وهذا يتوقف على حسب توافر الري .",
            'title' => "الوقت المناسب لزرع الشتلات في حقلك"
        ]);
        $step17 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 3,
            'interval' => 1,
            'image'=>"g8.png",
            'description' => "يمكن أن يساعد استخدام مبيدات الأعشاب قبل ظهورها في منع انتشار الحشائش والسيطرة عليها في حقولك عند استخدامها بشكل صحيح . تشتمل إزالة الأعشاب الضارة على مكافحة ظهور الأعشاب الضارة قبل تواحدها لتجنب نموها . إليك بعض التوصيات : \r\n•مبيدات الأعشاب قبل ظهورها تستخدم عادة لتجنب إنبات الحشائش السنوية . \r\n• بعد يومين إلى ثلاثة أيام من الزرع ، يمكن استخدام مبيدات الأعشاب المعتمدة على الفلوكلورالين بمعدل 800 مل لكل فدان ، مخففة في 200 لتر من الماء . \r\n• قم دائماً بقراءة الملصق بعناية ، واتخاذ الاحتياطات اللازمة عند استخدام المنتج . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مبيدات الأعشاب قبل ظهورها التي تناسب أغراضك .",
            'title' => "حطط جيدا لمكافحة الاعشاب قبل ظهورها"
        ]);

        $step18 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 2,
            'image'=>"g9.png",
            'description' => "فيما يلي بعض التوصيات الإضافية حول موعد وكيفية زراعة شتلات الطماطم :\r\n• المسافة الموصى بها للأنواع غير المحددة ( الأصناف ذات النمو المحدد ) هي 75-90 سم × 30-45 سم \r\n• المسافة الموصى بها للأنواع غير المحددة ( الأصناف دون حد نمو محدد مسبقا ) هي 90-120 سم × 30-45 سم .\r\n•قم بري الأخاديد بغزارة قبل 3-4 أيام من الزرع . \r\n • اسحب الشتلات من تربة البذر بعناية ، واجمعها في وعاء . \r\n• تأكد من أن النباتات الصغيرة لديها ما يكفي من التربة حول الجذور للبدء في تطوير الجذور . \r\n• إذا لزم الأمر ، قم بإزالة بعض الفروع السفلية من الشتلات لتنظيف المظلة الخضرية . \r\n• قم بزراعة الشتلات بعمق كاف تحت التربة ، بحيث لا يتبقى فوق سطح التربة سوى الأوراق . \r\n• اضغط على التربة بقوة وحزم حول الجذور للقضاء على جيوب الهواء . \r\n• تذكر أن لديك أيضا خياراً استخدام آلة زرع الشتلات . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن المسافة التي تناسب أغراضك ، في حالة الشك .",
            'title' => "كيفية زراعة شتلات الطماطم"
        ]);
        $step19 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 2,
            'image'=>"g10.png",
            'description' => "يعتبر الري بعد الزرع مهما لربط الشتلات بالتربة وتقليل الصدمة للجذور . فيما يلي بعض التوصيات الأخرى حول كيفية خلال الأسابيع الأولى في الحقل :\r\n• قم بري  الشتلات بالماء قبل الزرع لتنعيم التربة حول الجذور . \r\n• قم بالري مرة أخرى بعد الزرع مباشرة لربط التربة حول النبات الصدمة الاسموزية . والحد من \r\n• يجب التخطيط للري مرتين بعد 5 و 10 أيام من الزرع . \r\n• خلال فصل الصيف ، لا تنس الري لمرات أكثر ( 5-6 أيام ) ، أو على حسب الرطوبة . \r\n• تجنب الإفراط في الري . فالرطوبة الزائدة قد تعزز انتشار الأمراض الفطرية وتسبب الإجهاد .",
            'title' => "قم بري الشتلات بالماء بسخاء قبل وبعد الزرع"
        ]);
        $step20 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 3,
            'image'=>"g11.png",
            'description' => "• نفذ عملية ملء الفجوات في غضون 10 أيام من أول عملية زرع .\r\n• قم بذلك خلال ساعات المساء أو في الأيام الملبدة بالغيوم لتقليل الصدمة إلى النباتات . \r\n• استخدم الشتلات التي احتفظت بها بعد تقليم الشتلات في الحضانة . وستكون الشتلات الإضافية مفيدة جداً في حال الحاجة إليها . \r\n• لا تنس أن تروي النباتات المزروعة حديثا .",
            'title' => "استخدام الشتلات الاضافية لسد الفجوات في الحقل"
        ]);
        $step21 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 3,
            'interval' => 3,
            'image'=>"g8.png",
            'description' => "تستخدم مبيدات الأعشاب بعد ظهورها ضد الحشائش التي نمت بالفعل في الحقل . حيث يتم رشها على النبات ، وتكون أقل فاعلية إذا تم غسلها من سطح الورقة بسبب الأمطار أو الري . فيما يلي بعض التوصيات حول كيفية استخدامها : \r\n• هناك أساساً نوعان من مبيدات الأعشاب بعد ظهورها : مبيدات ملامسة ، ومبيدات جهازية . \r\n• تؤثر مبيدات الأعشاب الملامسة على أجزاء النبات التي تم رشها فقط ، أي يجب أن يكون الرش على الحشائش شاملاً . \r\n• مبيدات الأعشاب الجهازية تؤثر على النبات بأكملها وتكون فعالة بشكل خاص ضد الأعشاب الضارة أو النباتات التي تنمو من الأجزاء النباتية الموجودة تحت الأرض . \r\n• يمكن أيضا تصنيف مبيدات الأعشاب بعد ظهورها على أنها انتقائية ( تعمل ضد محصول معين ) أو غير انتقائية ( لمكافحة الأعشاب الضارة على نطاق واسع ) . \r\n• الميتربيوزين ( 0.11 -0.2 كجم لكل فدان ) ، يمكن تطبيقه عندما يحتوي المحصول على 4-6 أوراق لمكافحة بعض الحشائش عريضة الأوراق وأنواع الحشائش العشبية\r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مبيدات الأعشاب -بعد ظهورها- الأكثر ملاءمة لأغراضك .",
            'title' => "حطط لتعشيب جيد عن طريق استخدام مبيدات الاعشاب بعد نموها"
        ]);

        $step22 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 3,
            'interval' => 4,
            'image'=>"g12.png",
            'description' => "تنمو النباتات في هذه المرحلة بسرعة كبيرة ، وتحتاج إلى المزيد من الطعام على هيئة مغذيات لدعم هذا النمو . الآن ، وقد تم استهلاك الأسمدة المضافة إلى التربة قبل الزراعة . إذا كنت تستخدم الري بالغمر ، فيوصى بنثر المغذيات على جانبي التلال : \r\n• ضع كريات الأسمدة على الأخاديد ، واخلطها في التربة فيما يسمى بالنثر الجانبي . \r\n• في هذه المرحلة ، تتم إضافة ربع إجمالي الاحتياجات من النيتروجين ، والتي تصل إلى 20 كجم من اليوريا لكل فدان . \r\n• إذا لم تكن هناك أمطار متوقعة ، فلا تنس أن تروي المحصول حتى تتمكن العناصر الغذائية من الوصول إلى جذور النباتات . \r\n• في حالة استخدام الري بالتنقيط ، يمكن خلط الأسمدة بماء الري بالجرعات الموصى بها . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك .",
            'title' => " قم باضافة التطبيق الانقسامي(المجزأ)الأول من الأسمدة المعدنية "
        ]);

        $step23 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 4,
            'image'=>"g13.png",
            'description' => "يعتبر الري في الوقت المناسب ضروريا للنمو الخضري الجيد ونمو الزهور ومجموعات الفاكهة وتطور الفاكهة . وبالتالي ، يمكن الحصول على إنتاجية أعلى عند مستوى الرطوبة الأمثل وظروف خصوبة التربة . ستعتمد متطلبات المياه بالطبع على هطول الأمطار ، وكذلك أيضا على نوع التربة والموسم . اتبع التوصيات الواردة أدناه لنباتات صحية وإنتاجية عالية : \r\n• خلال الطقس الحار والجاف ، يجب الري كل 4-5 أيام . \r\n • خلال الطقس البارد الرطب ، يمكنك الري على فترات قد تصل إلى مرة كل 7-12 يوما . \r\n• لا تنس أن التربة الرملية تتطلب ريا أكثر تكرارا من التربة الطينية . \r\n• تجنب الري كثيرا بعد فترة طويلة من الجفاف ؛ فهذا قد يسبب تشوه الفاكهة . \r\n• لا تفرط في الري ، لأن محاصيل الخضر عادة ما تكون حساسة للغاية للري الزائد وتنقيع الماء .",
            'title' => "حان الوقت لتروي محاصيلك لتحقيق نمو قوي"
        ]);

        $step24 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 3,
            'interval' => 5,
            'image'=>"g14.png",
            'description' => " سترفع العصي المغروسة بشكل عمودي النباتات عن الأرض ، وتسمح بدوران الهواء في المظلة الخضرية . قبل القيام بأي شيء  ، تأكد أن النباتات الخاصة بك من النوع غير المنتشر ، أي أنها تنمو بشكل مستقيم نحو الأعلى . يمكن القيام بعملية توقيف العصي في أي وقت بعد الزرع ، وبعد شهر على الأقل . فيما يلي بعض التوصيات حول كيفية وتوقيت استخدام العصي في حقولك : \r\n•يمكنك استخدام العصي الخشبية أو البلاستيكية أو الخيزرانية ، والتي يمكنك إعادة استخدامها في المواسم التالية . \r\n• يجب أن تكون العصي على ارتفاع حوالي 200 سم ، وغرسها على عمق حوالي 30 سم في الأرض قبل أن يطور النبات جذوره \r\n• مع نمو النبات ، اربط الجذع بالعصى بالحبال الزراعية أو الأقواس دون إتلاف النبات . \r\n• سيحول هذا الوقاية من الأمراض . دون تكسير الفروع والتلامس مع التربة ، وبالتالي \r\n• كوم التربة حول قاعدة السيقان تدريجياً لتعطي السيقان دعماً إضافيا ًعند حمل الثمار  .",
            'title' => "استخدم طريقة دعم النبات للمحافظة عللى صحة النبات وقدرتة على حمل الفاكهة"
        ]);
        $step25 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 3,
            'interval' => 6,
            'image'=>"g14.png",
            'description' => "تتكون تربية نباتات الطماطم من إزالة النمو النباتي غير المرغوب به من أجل تقليل كثافة المظلة الخضرية ، وزيادة مقدار تعرض النبات للضوء ، وبالتالي تحسين احتمال نمو الثمار . كما يجب قطع الأوراق الموجودة عند قاعدة النباتات وحتى ارتفاع يتراوح بين 30-60 سم لتجنب انتقال الأمراض من التربة . مما يؤدي إلى زيادة العائد المبكر والجودة الكاملة من خلال القيام بذلك . كما أن تقليم الفروع والأوراق المريضة والتالفة من النبات يحسن أيضا من الصحة العامة للنبتة .",
            'title' => "ازالة النمو النباتي الغير مرغوب به لنمو فواكة جيدة"
        ]);

        $step26 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 4,
            'interval' => 1,
            'image'=>"g12.png",
            'description' => "إن نباتات الطماطم في حقلك هي الآن في مرحلة إنتاج الفاكهة . وهذا يعني أن النباتات تتطلب كميات كبيرة من النيتروجين والمغذيات الدقيقة لتطوير الفواكه بشكل صحيح . إذا كنت تستخدم الري بالغمر ، فإن أفضل طريقة لتخصيب نباتاتك هي عن طريق الرش الجانبي للمغذيات : \r\n• ضع كريات الأسمدة في الأخاديد ، واخلطها في التربة . \r\n• يضاف الربع الأخير من النيتروجين في هذه المرحلة إلى النباتات ، والتي تبلغ 20 كجم من اليوريا لكل فدان . \r\n• في حالة عدم توقع هطول أمطار ، لا تنس الري حتى تتمكن العناصر الغذائية من الوصول إلى الجذور . \r\n• في حالة استخدام الري بالتنقيط ، يمكن خلط الأسمدة بمياه الري . \r\n• اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك .",
            'title' => "التطبيق الانقسامي الثاني للأسمدة"
        ]);
        $step27 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 4,
            'interval' => 1,
            'image'=>"g15.png",
            'description' => "فكر في تكميل التطبيق الانقسامي الثاني للنيتروجين بالمغذيات الدقيقة مثل البورون والزنك والمنغنيز والحديد والكالسيوم لتحقيق نمو متوازن وتطوير جيد للفاكهة . إليك بعض التوصيات الأخرى : \r\n• خطط للرش الورقي لمحلول يحتوي على البورون ، مع البوراكس ( 4 جم / لتر ) على سبيل المثال . \r\n• في التربة التي تعاني من نقص الزنك ، تأكد من إضافة الزنك ، على سبيل المثال على هيئة كبريتات الزنك ( 5 جم / لتر ) . \r\n• إذا لم تكن متأكدا ، فاختبر تربتك أو نباتاتك لمعرفة محتوى المغذيات الدقيقة قبل اختيار المنتج . \r\n• اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن المزيج المغذي الأنسب لأغراضك .",
            'title' => "أضف المغذيات الدقيقة الى نباتاتك لنمو فاكهة جيدة"
        ]);
        $step28 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 4,
            'interval' => 2,
            'image'=>"g16.png",
            'description' => "قد تؤدي زيارات النحل للمحاصيل خلال فترة الإزهار إلى زيادة الإنتاج النهائي في حقول الخضار بنسبة 10 % على الأقل . وبالتالي ، فقد يكون من المفيد وضعها في الحقل أو حوله في بداية نمو الأزهار ( عادة 1-2 خلية نحل صحية لكل هكتار ) . ومع ذلك ، فإنه في العديد من المناطق ، قد لا يكون من الضروري وضع خلايا النحل داخل الحقل ، لأن نحل العسل يمكن أن يسافر من على بعد أميال ، وينجذب بشكل طبيعي إلى زهور الخضروات . من المهم أيضا التحكم في استخدام المبيدات الحشرية واسعة الطيف للحفاظ على صحة النحل .",
            'title' => "يزيد النحل من تلقيح الزهور وبالتالي الانتاجية"
        ]);

        $step29 = Step::create([
            'plant_schedule_id' => 4,
            'stage_id' => 5,
            'image'=>"g17.png",
            'interval' => 1,
            'description' => "قم بمراقبة نمو محصولك بشكل منتظم ومتكرر . قم بالمشي بين الصفوف الزراعية بطريقة عشوائية أو متعرجة ، وتحقق من - علامات وأعراض الأمراض أو الآفات أو مشاكل النقص . وتظهر أوجه القصور ونقص مقومات الحياة على هيئة تغير يطرأ على لون الأوراق وضعف قوة وحيوية النباتات . أما الأمراض ، فغالبا ما تكون مرئية على هيئة تغير في اللون أو تبقع أو تلون على هيئة خطوط طولية أو عرضية على الأوراق أو السيقان أو الجذور . أخيرا ، تذكر أن معظم الحشرات الموجودة في الحقل مفيدة لمحصولك . أما الضارة منها ، فهي تهاجم محصولك تاركة وراءها على الأوراق والبراعم على هيئة ثقوب . تأكد . التحدث مع جيرانك وتبادل المعلومات حول الأمراض الحالية مع مجتمعك المحلي . ابحث أيضا عن الدعم من موفري من خدمات الإرشاد الزراعي العام في منطقتك .",
            'title' => "راقب الحقل بشكل منتظم ومتكرر"
        ]);

        $step30 = Step::create([
            'plant_schedule_id' => 14,
            'stage_id' => 6,
            'image'=>"g18.png",
            'interval' => 1,
            'description' => "يتم قطف الفواكه عادة على فترات كل 4-5 أيام في الصيف ، وعلى فترات أسبوعية خلال فصل الشتاء . استخدم الصناديق الكبيرة للفواكه التي لا تزال خضراء ، أو قم بتعبئة الفواكه في صناديق واسعة ضحلة وقابلة للتكديس إذا كانت ناضجة بالفعل لتجنب التلف الناجم عن الضغط . يجب أن تحتوي حاويات القطف على جدران داخلية ناعمة لمنع تآكل الثمار الناجم عن الاحتكاك . يجب تظليل الطماطم ( البندورة ) التي يتم حصادها في الحاويات لتقليل الإجهاد والضرر الناتج عن الحرارة . يوصى بعدم ملء الحاويات بأكثر من 10 كجم من الفاكهة . في أي حال ، يجب تنظيف معدات القطف وتعقيمها في نهاية كل يوم حصاد للوقاية من الأمراض .",
            'title' => "اعداد أدوات الحصاد وتنظيفها"
        ]);
        $step31 = Step::create([
            'plant_schedule_id' => 14,
            'stage_id' => 6,
            'image'=>"g19.png",
            'interval' => 1,
            'description' => "الظروف : \r\n• يجب قطف الطماطم خلال أبرد جزء من اليوم ، مثل الصباح الباكر أو بعد العصر . حيث أن الفواكه المعرضة للشمس لعدة ساعات تكون أكثر عرضة للكدمات أثناء عملية القطف . \r\n• لا تدع الفواكه المحصودة في الشمس لفترات طويلة من الزمن . استخدم القطع القماشية لتغطيتها . \r\n• تجنب قطف الفواكه المغطاة بندى الصباح أو مياه الأمطار . وقم بتأخير الحصاد حتى يجف سطح الفاكهة ، حيث يمكن للرطوبة أن تساعد في انتشار التعفن والمرض . \r\nالطريقة : \r\n• من المهم إزالة ثمار الطماطم بعناية من النبات عن طريق لويها بلطف أو تدويرها . \r\n• يجب إزالة الجذع قبل وضع الثمرة في الحاوية ، لأنه قد يتلف حبات الطماطم الأخرى ، خاصة إذا كانت ناضجة . حتى الكدمات \r\n• إن التعامل مع الطماطم بغاية الدقة أمر ضروري ، لأنه الطفيفة قد تشوه الفاكهة . \r\n• يوصى باستخدام القفازات القطنية أثناء الحصاد لتفادي الأضرار التي تلحق بالثمار وكذلك ملامسة الجلد بشكل مباشر . \r\n• لا يمكنك -تحت أي ظرف من الظروف- رمي الفاكهة أو إسقاطها في وعاء القطف .",
            'title' => "الظروف والطرقة المناسبة لحصاد الطماطم"
        ]);

        $step32 = Step::create([
            'plant_schedule_id' => 15,
            'stage_id' => 6,
            'interval' => 2,
            'image'=>"g20.png",
            'description' => "تتضمن ظروف التخزين الجيدة ما يلي : \r\n• الحماية من أشعة الشمس والحشرات والقوارض والطيور . \r\n• التهوية الجيدة . \r\n• الظروف الصحية الجيدة . \r\n• الاستخدام الفعال للمساحة . \r\n• سهولة الحفاظ على المحصول المخزن وإدارته . \r\n • سهولة الوصول للتحميل والتفريغ . إرشادات التخزين على المدى القصير ( حتى أسبوع ) :\r\n• تأكد من أن البيئة جيدة التهوية و / أو ظليلة لتقليل تراكم الحرارة . تأكد من من التنفس الحيوي .\r\n• تظل الطماطم المخزنة في درجة حرارة الغرفة في الداخل ( 15-25 درجة مئوية ) أو في مكان مظلل بالخارج صالحة لمدة 4-7 أيام .\r\n• إرشادات للتخزين طويل المدى : \r\n• تبرد الطماطم إلى 13 درجة مئوية بعد الحصاد مباشرة . \r\n• بالنسبة للتخزين طويل الأجل ، من المهم الحفاظ على درجات حرارة تتراوح بين 10-15 درجة مئوية والرطوبة النسبية 85-95 % . \r\n• التهوية الجيدة في غرفة التخزين ضرورية أيضا .",
            'title' => "تخزين الطماطم بشكل صحيح"
        ]);

        $step33 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 7,
            'interval' => 1,
            'image'=>"fieldPreparation1.png",
            'description' => "تأكد من إزالة جميع مخلفات المحاصيل بعد الحصاد لتجنب احتمال إعادة ظهور المرض في نفس الحقل . أما في حالة انتشار الآفات ، فاحرث الأرض مع تقليب التربة لتعريض الحشرات للحيوانات المفترسة والتعقيم بالإشعاع الشمسي ( التشميس ) . فكر في استخدام المحاصيل الغطائية بين الفصول لزيادة محتوى الكربون العضوي ورطوبة التربة . أخيرا ، فكر في ترك الحقل في حالة البور لفترة من الوقت لتعزيز إمكانياته .",
            'title' => "قم باجراء الادارة الحقلية المناسبة بعد الحصاد"
        ]);
        $step34 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 7,
            'image'=>"g21.png",
            'interval' => 1,
            'description' => "الطماطم هي جزء من العائلة الباذنجانية . والتي تشمل البطاطا والفلفل والفليفلة والفلفل الحار والباذنجان والتبغ . لا ينبغي أن تزرع الطماطم ( البندورة ) على التوالي في نفس الحقل ، ويتطلب الحقل أخذ استراحة لمدة سنة واحدة على الأقل بين زراعة الطماطم ( البندورة ) ، أو غيرها من المحاصيل التي تنتمي إلى العائلة الباذنجانية . كما يجب تجنب المحاصيل التي تنتمي إلى عائلة القرعيات ( الخيار ، القرع ، قرع الكوسة والكرنب ، والبطيخ ) . فيما يلي بعض المحاصيل الموصى بزراعتها بعد الطماطم : \r\n• البقوليات ( الفول ، البازلاء ، إلخ ) \r\n• الحبوب ( الأرز والسورغم والقمح والدخن وغيرها ) \r\n• المحاصيل الكرنبية ( الكرنب ، القرنبيط ، الكرنب الساقي ( اللفت الألماني ) ، إلخ ) \r\n• زهور الزينة ( مثل القطيفة )",
            'title' => "فكر في دورة المحاصيل القادمة"
        ]);
        $step35 = Step::create([
            'plant_schedule_id' => 11,
            'stage_id' => 7,
            'image'=>"g23.png",
            'interval' => 1,
            'description' => "",
            'title' => "تجنب انتشار التبقع البكتيري في نباتات الطماطم في حقلك"
        ]);
        $step36 = Step::create([
            'plant_schedule_id' => 11,
            'stage_id' => 7,
            'interval' => 1,
            'image'=>"g22.png",
            'description' => "",
            'title' => "تجنب الخضروات في حقلك بمرض اللفحه المبكره حقلك"
        ]);
        $step37 = Step::create([
            'plant_schedule_id' => 11,
            'stage_id' => 7,
            'image'=>"g24.png",
            'interval' => 1,
            'description' => "",
            'title' => "تجنب انتشار الديدان الخيطية في النباتات في حقلك"
        ]);





///////////////////////////////////////////////////////////////////

$plant = Plant::create();
$plant->name = "الباذنجان";
 $plant->image = "eggplant.png";
$plant->description = "إذا كنت تفكر في بدء زراعة الباذنجان من البذور ، فتأكد من شراء بذور معتمدة من بائع موثوق به. وإلا فإن معدلات الإنبات ربما تكون منخفضة وتضيع وقتك. ضع في اعتبارك أن بذور الباذنجان لا تتحمل درجة البرودة المنخفضة. وبالتالي ، قد تفكر في زرعها في قاع التربة للحفاظ على درجة الحرارة عند المستويات المثالية وهى C°21-25 (°F 70-77). يمكنك إستخدام حشائش (Turfs) كتربة إصطناعية لكي توّفر التهوئة المثالية. إذا كنت تخطط لزراعة أكثر من نبتة ، فتأكد من ترك مساحة لا تقل عن 40 سم (16 بوصة) حول كل نبتة. تأكد من إبقاء البذور رطبة حتى الإنبات. سوف تنبت البذور تقريبًا في غضون 8 إلى 17 يومًا ، وفقًا للظروف البيئية. الوقت المناسب لنقلهم للزراعة فى مواقعهم النهائية هو 4-6 أسابيع بعد نثر البذور عندما ينمو بهم من 3-4 أوراق حقيقية
\r\n \r\n إذا كنت لا تريد أن تنقل البذور أو لا تريد اقتلاعها من منبتها ، فيمكنك شراء نباتاتك من بائع شرعي معتمد وموثوق وقم بزراعتها مباشرة في مواقعها النهائية. ضع في اعتبارك أن زراعة الباذنجان لن تنجح في درجات الحرارة المنخفضة التى تقل عن 21°C – 70°F.
\r\n  \r\n يفضل بعض المنتجين تقليم السيقان الطرفية للنبتة ، مما يجبره على النمو أكثر من خلال الساقان الرئيسيان. التقليم ايضا يسهل عملية التهوية ويجعلها مناسبة وبالتالي يحمي النبات من العدوى الناتجة من الرطوبة. ولكن يرى بعض المزارعين الآخرين أن التقليم يؤخر من عملية نمو النبات وانتاج الثمرة. وبشكل عام فإن العديد من المنتجين يساعدون النبات فى النمو بشكل جيد عن طريق إزالة معظم الزهور المتقلصة أو الضعيفة تاركين الأقوى. تساعد هذه الطريقة النبات في توزيع المزيد من العناصر الغذائية على الزهور المتبقية ، والتي ستنتج في النهاية ثمارًا أقل ولكن ذات حغرام أكبر.
\r\n  \r\n يفضل معظم المزارعون غرس وتثبيت نبات الباذنجان في التربة بإستخدام العصيان (stacks) الخشبية والتي عادةً ما يتراوح طولها ما بين 1 – 1.5 متراً. (50-60 بوصة). تمنع هذه التقنية أوراق الشجر والفواكه من ملامسة الأرض ، وبالتالي تحمي النبات من آفات التربة وأمراضها. علاوة على ذلك ، فإن طريقة التراص تجعل من السهل حصاد الثمار وتحسين التهوية والصحة العامة للنبات
 \r\n  \r\n الباذنجان عموما يمكنه تحمل مدى من متوسط إلى مرتفع من الجفاف. من ناحية أخرى ، فإنه لا يحب التربة الفطرية المندية أو شديدة الرطوبة. وبالتالي يجب تجنب الري المفرط. في المتوسط يحتاج الباذنجان إلى لتر واحد من الماء لكل نبات كل 3 أيام. هذا بالطبع ليس قاعدة ثابته.لانه يعتمد على نوع التربة قد تحتاج التربة الرملية إلى مزيد من الماء لأنها عادة لا تستطيع الاحتفاظ بكمية كافية من الماء بالقرب من الجذور. من ناحية أخرى قد تحتاج كمية مياه أقل فى التربة الطينية الثقيلة ، حيث لا يوجد تصريف مناسب للماء.
\r\n   \r\n يفضل العديد من المزارعين استخدام الأسمدة أو السماد العضوي “الكومبوست” (manure) او (compost) كطرق تسميد خلال فترة النمو اذا كانت ستتم الزراعة فى الحديقة وذلك لزيادة النيتروجين والبوتاسيوم بشكل أساسي في التربة.
      \r\n  \r\n ينضج الباذنجان ويمكن حصاده فى فترة من 60 إلى 80 يومًا من عملية الزرع. من الأفضل حصاد الثمار قبل أن يتغير اللون تصبح بذورها بنية. إذا سارت الأمور على ما يرام فقد تتمكن من حصاد ما يصل إلى 6-8 باذنجانة جيدة الشكل من كل نبات فى شكل صحي ومكتمل النمو. يحصد المزارعون زوي الخبرة فى المزاراع التجارية من 12-15 باذنجانة لكل نبات صحي ، ولكن هذا يعتمد أيضًا على نوع الباذنجان.";
$plant->season = "all";
$plant->save();





$stage1 = Stage::create([
    'name' => "مرحلة ماقبل الشتلات",
    'plant_id' => 2,
    'interval' => 4,
    'step' => 1,
    'image' =>'s1.png',
    'watering_period'=>3,
]);


$stage2 = Stage::create([
    'name' => "مرحلة الشتلات",
    'plant_id' => 2,
    'interval' => 4,
    'step' => 2,
    'image' =>'s2.png',
    'watering_period'=>3,
]);


$stage3 = Stage::create([
    'name' => "مرحلة النمو",
    'plant_id' => 2,
    'interval' => 5,
    'step' => 3,
    'image' =>'s3.png',
    'watering_period'=>5,
]);


$stage4 = Stage::create([
    'name' => "مرحلة الازهار",
    'plant_id' => 2,
    'interval' => 3,
    'step' => 4,
    'image' =>'s4.png',
    'watering_period'=>5,
]);
$stage5 = Stage::create([
    'name' => "مرحلة الاثمار",
    'plant_id' => 2,
    'interval' => 4,
    'step' => 5,
    'image' =>'s5.png',
    'watering_period'=>5,
]);
$stage6 = Stage::create([
    'name' => "مرحلة الحصاد",
    'plant_id' => 2,
    'interval' => 4,
    'step' => 6,
    'image' =>'s6.png',
    'watering_period'=>4,
]);

$stage7 = Stage::create([
    'name' => "مرحلة مابعد الحصاد",
    'plant_id' => 2,
    'interval' => 2,
    'step' => 7,
    'image' =>'s7.png',
    'watering_period'=>0,
]);



$plantSchedule1 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "اختيار النبات",
    'image'=>"selectPlant.png",
]);

$plantSchedule2 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "الزراعة",
    'image'=>"farmer.png",
]);
$plantSchedule3 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "العناية بالنبات",
    'image'=>"training.png",
]);
$plantSchedule4 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "المراقبة",
    'image'=>"monitoring.png",
]);
$plantSchedule5 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "اختيار الموقع",
    'image'=>"siteSelectoin.png",
]);
$plantSchedule6 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "تجهيز الحقل",
    'image'=>"fieldPreparation.png",
]);

$plantSchedule7 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "ازالة الاعشاب الضارة",
    'image'=>"weeding.png",
]);
$plantSchedule8 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "الري",
    'image'=>"lrrigation.png",
]);

$plantSchedule9 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "التسميد العضوي",
    'image'=>"organic.png",
]);

$plantSchedule10 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "التسميد الكيميائي",
    'image'=>"chemical.png",
]);
$plantSchedule11 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "اجراء وقائي",
    'image'=>"preventive.png",
]);
$plantSchedule12 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "حماية النباتات: كيميائية",
    'image'=>"protection.png",
]);
$plantSchedule13 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "حماية النباتات: عضوية",
    'image'=>"protection2.png",
]);
$plantSchedule14 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "خلال الحصاد",
    'image'=>"harvesting.png",
]);
$plantSchedule15 = PlantSchedule::create([
    'plant_id' => 2,
    'title' => "بعد الحصاد",
    'image'=>"postHarvest.png",
]);


$step1 = Step::create([
    'plant_schedule_id' => 20,
    'stage_id' => 8,
    'interval' => 1,
    'image'=>"siteSelection.png",
    'description' =>"الباذنجان هو محصول متعدد الاستخدامات ويتكيف مع ظروف العديد من المناطق ، حيث يتم زراعته على مدار العام . يمكن زراعته في أي نوع من أنواع التربة ، ولكن لا يمكن الوصول إلى نمو جيد وعائدات أعلى إلا إذا سادت الظروف المثلى \r\n. وفيما يلي بعض التوصيات لاختيار أفضل موقع لزراعة الباذنجان من حيث خصائص التربة : \r\n• اختر التربة الطينية العميقة ، الخصبة ، الطميية أو الطينية ، والتي تحتوي على ما يكفي من المواد العضوية • يتراوح معدل حموضة التربة المناسب للنمو ما بين 5.5 - 7.5 ، ولكن المستوى الأمثل يتراوح بين 5.5 - 6.5 . اختر التربة الأخف وزناً للحصول على غلة مبكرة في الموسم ، ولكنها أقل ثماراً . تكون\r\n • اختر الطين الطميي والرمل الطميي للحصول على عائدات أعلى ( ولكن في وقت لاحق من الموسم ) .\r\n . خطط لتصريف جيد ، حيث أنه من الضروري تجنب التربة المغمورة أو الممطرة .\r\n . تجنب الزراعة في التربة المالحة أو القلوية ، لأن الباذنجان لا ينمو بشكل جيد فيها .\r\n • تجنب الحقول التي تمت زراعتها في السابق بالطماطم أو البطاطا الفلفل أو التبغ .",
     'title' => "خصائص التربة المثالية لإنتاج الباذنجان",
]);

$step2 = Step::create([
    'plant_schedule_id' => 20,
    'stage_id' => 8,
    'interval' => 1,
    'image'=>"siteSelection.png",
    'description' => "فيما يلي بعض المعلومات حول أفضل مناخ للباذنجان من حيث درجات الحرارة المثلى والرطوبة النسبية وهطول الأمطار : .\r\n . يجب أن تتم زراعة الباذنجان بعد الصقيع الربيعي الأخير في المنطقة المختارة .\r\n • يتطلب الباذنجان الطقس الخالي من الصقيع لفترات تصل إلى 5 أشهر .\r\n • ستنبت البذور جيدا عند درجات الحرارة التي تبلغ 25 درجة مئوية • تحتاج نباتات الباذنجان إلى درجات الحرارة المثلى في اليوم حوالي 27-29 درجة مئوية ، ولكن يمكنها أن تنمو في حدود 35-17 درجة مئوية .\r\n • أما في درجات الحرارة التي تكون أعلى من 35 درجة مئوية ( خلال النهار ) وأقل من 17 درجة مئوية ( خلال اليل ) ، فستكافح النباتات من أجل النمو وستتأثر جودة الفاكهة .\r\n • هطول الأمطار من حوالي 600 - 1000 مم هو الأمثل لنمو جيد للنباتات .\r\n • في المناطق ذات الرطوبة النسبية العالية أو الحقول المروية ، قد تكون بحاجة إلى معدل هطول أمطار منخفض .\r\n • تساقط الأمطار بشكل متكرر خلال مراحل تكوين الأزهار أو الثمار يشكل عائقا أمام نموها .\r\n • تساقط الأوراق والذبول وتعفن الجذور والنباتات قد ينجم عن",
     'title' => "المناخ الأفضل لزراعة الباذنجان ",
]);

$step3 = Step::create([
    'plant_schedule_id' => 16,
    'stage_id' => 8,
    'image'=>"plantSelection.png",
    'interval' => 2,
    'description' => "فيما يلي بعض أصناف الباذنجان التي طورتها المنظمات البحثية المحلية والتي يمكن زراعتها في منطقتك / ولايتك (وفقًا لإيكيسان).  تذكر أنه قد يتم إصدار أصناف جديدة كل عام أو موسم ، لذا تأكد من التحدث إلى جيرانك ، والمستشار ، وممثلي شركات البذور ، والمتخصصين في الجامعات ، وتجار التجزئة حول المستجدات والأصناف التي تناسب أغراضك: ",
    'title' => "أصناف الباذنجان لأجزاء مختلفة من البلاد",
]);

$step4 = Step::create([
    'plant_schedule_id' => 16,
    'stage_id' =>8,
    'image'=>"plantSelection.png",
    'interval' => 2,
    'description' => " تشمل أعراض حفار ثمار الباذنجان علامات التغذية على الزهور والبراعم وذبول أطراف السيقان الصغيرة النامية والسيقان . كما يقوم الحفار بإغلاق فتحات الدخول والخروج بواسطة البراز المجفف على الفاكهة . تمتلئ الفواكه المجوفة بالبراز الأصفر ، وتبدأ في النهاية بالتعفن . كما أن الفواكه التي تنتجها هذه النباتات قد تكون غير صالحة للاستهلاك . فيما يلي بعض الأصناف التي تتحمل الإصابة / تقاوم هذه لآفة : • الباذنجان العنقودي الأرجواني ، 26 - AM - 62 ، BB ، الباذنجان الطويل الأرجواني ، الباذنجان المدور الأرجواني ، 4 - H ، والباذنجان الأبيض ، 4-17 SM ، وصنف أوشي ، والباذنجان الأبيض الطويل .",
      'title' => "الأصناف المقاومة لحفار ثمار الباذنجان ",
]);

$step5 = Step::create([
    'plant_schedule_id' => 21,
    'stage_id' => 8,
    'interval' => 3,
    'image'=>"tt1.png",
    'description' => "التشميس هو وسيلة سهلة وآمنة وفعالة من حيث التكلفة لتعقيم التربة وإنتاج شتلات صحية . ويتكون من استخدام الإشعاع الصادر من الشمس لتهيئة ظروف غير مواتية لمسببات الأمراض والأعشاب الضارة في مهاد البذور . ستعمل هذه العملية على تقليل الأمراض التي تنقلها التربة ، وكسر دورة حياة الحشرات والآفات وبذور الحشائش . أفضل وقت للتشميس هو خلال موسم الجفاف مع ارتفاع درجات الحرارة . ولتشميس التربة ، اتبع الخطوات التالية : • إضافة الماء لترطيب تربة البذر .\r\n • قم بتغطية التربة بأغطية بلاستيكية شفافة لمدة 3-4 أسابيع .\r\n • دفن حواف الأغطية في التربة .\r\n • بعد 3-4 أسابيع ، أزل الأغطية البلاستيكية واحرث التربة برفق • بعد حوالي 2-3 أيام ، قم بتسوية التربة وزرع البذور .",
       'title' => "تعقيم مهاد البذر باستخدام الإشعاع الشمسي",
]);
$step6 = Step::create([
    'plant_schedule_id' => 21,
    'stage_id' => 8,
    'interval' => 3,
    'image'=>"tt2.png",
    'description' => "مشاتل النباتات ( الحاضنات ) هي الأمثل لتعزيز معدل بقاء الشتلات تعد قيعان البذار المثارة في أماكن محمية ومشمسة وذات تربة خصبة هي الخيار المفضل للحاضنات . لتجنب الظروف الجوية الشديدة والآفات / الأمراض ، عادة ما يتم إنشاء قيعان البذور في الحقول المفتوحة داخل هياكل واقية ( مصدات الرياح ، الحاميات ، أنفاق النايلون ) أو في الداخل ، على سبيل المثال في الدفيئات ",
      'title' => "كيفية تحضير صفوف البذور في بيوت بلاستيكية",
]);

$step6 = Step::create([
    'plant_schedule_id' => 21,
    'stage_id' => 8,
    'interval' => 4,
    'image'=>"chim.png",
    'description' => " تأكد من خلط هذة المنتجات جيدا مع التربة مع اذافة السماد العضوي أثناء تحضير الحقل \r\n.الترايكوديرما فيردي wp %1.5 بواقع 2كجم لكل فدان \r\n.يتم استخدام كعكه النيم بمعدل 1كجم لكل 2-3 متر مربع",
    'title' => "عالج التربة اذا لزم الأمر لنمو محاصيل صحية",
]);


$step8 = Step::create([
    'plant_schedule_id' => 28,
    'stage_id' => 8,
    'interval' => 4,
    'image'=>"mo.png",
    'description' => "يمكن معالجة البذور قبل 24 ساعة من البذر بمساحيق أو محاليل مضادة للميكروبات أو مبيدات الفطريات ، على سبيل المثال مع الترايكوديرما فيريدي ( 4-10 جم / كجم بذور ) ، أو البكتيريا الزائفة المتألقة ( 10 جم / كجم بذور ) أو الأزوسبيريلوم ( 4 جم / كجم بذور ) . ثم تجفيف البذور المعالجة خلال فترة الليل في مكان محمي ، لثزرع في اليوم التالي . من المهم ضبط العلاج مع الخضروات المعنية حتى يتأثر بقاء البذور وإنباتها . أخيرا ، إذا كانت البذور التي تنوي زراعتها قد تمت معالجتها بأحد هذه المنتجات من قبل ، فليس من الضروري معالجة البذور مرة أخرى . اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن كون أي من الطرق المذكورة يناسب أغراضك .",
    'title' => "علاج البذور عن طريق الأساليب البيولوجية قبل البذر",
]);

$step9 = Step::create([
    'plant_schedule_id' => 27,
    'stage_id' => 8,
    'image'=>"mo2.png",

    'interval' => 4,
    'description' => "من الجدير بالذكر أن العديد من البذور التي يحصل عليها المزارعون قد تمت معالجتها مسبقاً لتجنب سلسلة من الأمراض . إذا لم يكن الأمر كذلك ، يمكنك معالجة بذور العديد من المحاصيل النباتية أو \" تغليفها \" بالمنتجات الكيميائية التالية لحمايتها من الأمراض والآفات . إليك بعض التوصيات : \r\n • لمكافحة الأمراض الفطرية : يمكن تطبيق المحاليل التي تحتوي على الثيرام أو الكابتان أو المانكوزب ( 2.5 جم / كجم من البذور ) ، وهذا من شأنه أن يوفر الحماية لمدة تصل إلى 3 أسابيع . \r\n • ضد الحشرات الماصة : سيحمي الإماكلوبريد 600 FS بواقع ( 5 مل / كلغ من البذور ) أو الثيوميثوكسام 70 WS بواقع ( 5 جم / كجم من البذور ) البذور لمدة تصل إلى 20 يوما بعد البذر . \r\n • في جميع الحالات ، يجب ترك البذور حتى تجف في الظل لحوالي 30 دقيقة إلى ساعة بعد العلاج . \r\n • اسأل مسؤول الإرشاد الزراعي أو تاجر التجزئة المحلي عن العلاجات الأنسب لأغراضك .",
    'title' => "المعالجات الكيميائية للبذور لتعزيز بقاء الشتلات",
]);

$step10 = Step::create([
    'plant_schedule_id' => 17,
    'stage_id' => 8,
    'interval' => 4,
    'image'=>"plantSelection.png",
    'description' => "يحتاج كل نوع من المحاصيل إلى معدل بذر معين لينبت ويتطور بشكل صحيح في التربة أو أمهدة البذور . وفي صفوف البذر ، يتم تحديد المعدل بواسطة عدد البذور المزروعة لكل مسافة معينة . هذا المعدل يختلف وفقا لظروف التربة ، وأصناف الباذنجان ، والموسم . ولكن يوصى بشكل عام باستخدام المعدلات التالية عند زرع بذور الباذنجان في الحاضنات : • بالنسبة للأنواع الهجينة ، 100-120 غرام من البذور تكفي لتنمية الشتلات لفدان واحد .\r\n . أما بالنسبة للأصناف الطبيعية ، فيرتفع هذا المعدل إلى 153-160 وحتى في بعض الأحيان 200-300 غرام من البذور لكل فدان .\r\n • يتم زرع البذور في خطوط متباعدة على مسافة 5-7 سم وعمق 3-2 سم . سيضمن عدد الشتلات الأمثل منافسة بسيطة للشتلات من قبل الأعشاب الضارة وهجمات الحشرات .\r\n • تحدث إلى جيرانك والمستشار الزراعي وممثلي شركة البذور والأخصائيين الجامعيين وتجار التجزئة حول معدلات البذر المناسبة في حالتك وبالنسبة لظروفك .",
       'title' => "ازرع البذور في الصفوف الزراعية وفقاً للمعدلات الموصى بها",
]);


$step12 = Step::create([
    'plant_schedule_id' => 17,
    'stage_id' => 8,
    'interval' => 4,
    'image'=>"g3.png",
    'description' => "ان بذر البذور في قيعان البذور مع التربة المخصبة يتيح لك الحصول إن بذر البذور في قيعان البذور مع التربة المخصبة يتيح على شتلات قوية لزرعها . واحدة من المشاكل التي قد تحدث من تلف الجذر عندما يتم سحب النباتات من التربة هي أن تعاني الشتلات لزرعها . قد يؤخر ذلك النمو أو يتسبب في موت الشتلات . ممارسات الري الجيدة يمكن أن تساعد في منع هذه المشكلة .",
    'title' => "كيفية زراعة البذور في الحضانة",
]);
/////////////////////////مرحلة الشتلات

$step5 = Step::create([
    'plant_schedule_id' => 25,
    'stage_id' => 9,
    'interval' => 1,
    'image'=>"g12.png",
    'description' =>"الباذنجان هو محصول طويل المدة ، ويحتاج إلى كمية جيدة من السماد الحيواني والأسمدة المعدنية لضمان إنتاجية عالية . يضيف السماد الحيواني المحتوى العضوي إلى التربة ، مما يساعد على الاحتفاظ بالمياه والمواد الغذائية . تعتمد كمية الأسمدة المعدنية إلى حد كبير على عوامل مثل : نوع المحصول ( طبيعي أو هجين ) ونوع التربة . فيما يلي بعض التوصيات لحقول الباذنجان : • يتضمن التسميد القاعدي إضافة السماد الحيواني بواقع ( 8-10 طن / فدان ) .\r\n • أما بالنسبة للأسمدة المعدنية ، فيتم إضافة نصف الكمية الإجمالية من النيتروحين N والكمية الإجمالية من الفسفور P و البوتاسيوم K.\r\n . وهذا يصل إلى 60 كجم / فدان من اليوريا ، و 40 كجم / فدان من ثنائي فوسفات الأمونيوم DAP و 32 كجم / فدان من كلوريد البوتاسيوم الحبيبي MOP للأصناف الطبيعية .\r\n • كما يصل في الأصناف الهجينة إلى 72 كجم / فدان من اليوريا ، و 50 كجم / فدان من ثنائي فوسفات الأمونيوم DAP و 32 كجم فدان من كلوريد البوتاسيوم الحبيبي MOP .\r\n • اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن المزيج الأنسب من المغذيات لاستخدامه في حقلك .",
     'title' => "تطبيق التسميد القاعدي اثناء اعداد الحقل",
]);



$step14 = Step::create([
    'plant_schedule_id' => 21,
    'stage_id' => 9,
    'interval' => 1,
    'image'=>"fieldPreparation1.png",
    'description' => "عند إعداد الحقول ، تأكد من اتباع التوصيات المذكورة أدناه : • قم بإجراء حراثة جيدة مع إرفاق صفيح حديدي أو محراث التسوية على عمق 35 سم لدمج ما تبقى من المخلفات النباتية والأعشاب الضارة في التربة .\r\n • اجمع الحجارة الصغيرة ، والأعشاب الضارة ، وقش المحصول السابق لتسهيل اتصال التربة بالبذور جيداً عند البذر .\r\n . في وقت لاحق ، قم بالفرم 3-5 مرات لتقليل حجم الكتل الترابية والضغط والحصول على تربة خفيفة .\r\n • قم بتسوية الحقل واستنزاف الحقل بشكل صحيح لتجنب مشاكل التشبع بالمياه في وقت لاحق من الموسم .\r\n • إعداد التلال في حال الزراعة في التربة الثقيلة ، أو الأخاديد في حال الزراعة في التربة الخفيفة بتياعد 60-75 سم .\r\n • قم بتقسيم الحقل إلى حقول أصغر -حسب حاجتك- لتسهيل الري",
     'title' => "قم بإعداد الحقول قبل وقت البذر بوقت طويل",
]);


$step7 = Step::create([
    'plant_schedule_id' => 24,
    'stage_id' => 9,
    'interval' => 1,
    'image'=>"chim.png",
    'description' => "خلال الشهر الأول ، تحتاج الشتلات إلى الكثير من العناصر الغذائية . ولا يعتبر السماد الحيواني مصدرا للمغذيات فحسب ، ولكنه يحتوي أيضا على ثروة من المواد العضوية والمياه ، مما يساعد في الحفاظ على بنية التربة الجيدة للصرف والتهوية . إليك بعض التوصيات : \r\n *يجب إضافة السماد الحيواني أو السماد العضوي المتحلل بالكامل إلى التربة بعد الحراثة الأخيرة وقبل تخطيط الصفوف ( الأخاديد ) . \r\n• الكميات الموصى بها تختلف باختلاف المحصول ، ولكنها عادة ما تكون في حدود 8-10 طن / فدان . تأكد من خلط السماد جيداً بالتربة وإيصاله إلى العمق المناسب . السماد \r\n• اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن الحيواني الذي يناسب أغراضك والكمية المحددة الذي توافق حالتك .",
    'title' => "اضافة السماد الحيواني خلال الحرث لدعم النباتات",
]);



$step14 = Step::create([
    'plant_schedule_id' => 18,
    'stage_id' => 9,
    'interval' => 2,
    'image'=>"g6.png",
    'description' => "يتم التخفيف عادة في غضون 2-3 أيام بعد ظهور الورقة الحقيقية الأولى ، أو بعد حوالي 5-7 أيام من البذر . إليك بعض التوصيات : \r\n•قم بإزالة المهاد الذي وضعته على قاع البذور بعد البذر . \r\n• اسحب الشتلات الضعيفة أو المريضة من التربة . \r\n• تأكد من أن الشتلات المتبقية تتباعد حوالي 5 سم داخل الصف . \r\n• ازرع الشتلات التي قمت بإزالتها في حاويات من التربة . وبعدها يمكن استخدامها لسد الفجوة في الحقل في وقت لاحق من الموسم .\r\n• هذا مهم بشكل خاص عند استخدام بذور باهظة الثمن",
    'title' => "تخفيف الشتلات لتنمو النباتات بشكل صحي"
]);


$step11 = Step::create([
    'plant_schedule_id' => 25,
    'stage_id' => 9,
    'interval' => 3,
    'image'=>"tt7.png",
    'description' => "إلى جانب إضافة السماد الحيواني إلى تربة البذر ( 2-4 كغم / م 2 من الحاضنات ) لتحسين بنيتها ومحتواها العضوي ، يوصى بتوفير المغذيات للشتلات لمنحها بداية قوية وتقويتها لباقي الموسم . بعد حوالي 7-10 أيام من تقليم الشتلات ، إذا كانت الأوراق تتحول إلى لون أخضر مصفر وباهت ، أضف أحد المنتجات أدناه إلى تربة البذر : \r\n • النيتروجين : 40 جم / متر مربع على هيئة كبريتات الأمونيوم أو محلول اليوريا بتركيز 0.25 ٪ ( 2.5 جم / لتر ) \r\n• الفوسفور : 50 جم / متر مربع على هيئة سوبر فوسفات \r\n • البوتاسيوم : 30 جم / متر مربع على هيئة كلوريد بوتاسيوم  \r\n• تحدث إلى جيرانك والمستشار الزراعي وممثلي شركة الأسمدة وتجار التجزئة لفهم الجرعات التي تناسب أغراضك .",
    'title' => "خصب حاضنات البذور لبدء انطلاق النباتات بصحة جيدة",
]);

$step13 = Step::create([
    'plant_schedule_id' => 17,
    'stage_id' => 9,
    'interval' => 4,
    'image'=>"g4.png",
    'description' => "تشير تقوية الشتلات إلى التعريض التدريجي للشتلات المزروعة في قاع البذر إلى بيئة أكثر قسوة . يزيد هذا من مقاومتها وفرص بقائها على قيد الحياة بعد الزرع . يمكن أن تتم التقوية بطرق مختلفة ، وذلك باستخدام الضوء ، ورفع درجات الحرارة ، أو الامتناع عن الري . \r\n• تعريض الشتلات تدريجياً إلى شدة ضوئية أعلى و / أو درجات حرارة أعلى على مدار فترة تتراوح من 7 إلى 10 أيام قبل الزرع . \r\n• خفض كميات الري أو الامتناع عن الري 4-5 أيام قبل الزرع .",
    'title' => "قم بتقوية الشتلات من لزيادة فرص بقائها على قيد الحياة",
]);



/////////

$step15 = Step::create([
    'plant_schedule_id' => 21,
    'stage_id' => 10,
    'interval' => 1,
    'image'=>"tt12.png",
    'description' => "عند يمكن تغطية الأخاديد بالمهاد أثناء التحضير الحقلي قبل الزرع ، وغالبا استخدام الري بالتنقيط . يتم زرع الشتلات في الشقوق أو الثقوب التي يتم عملها في الأغطية البلاستيكية الرقيقة على مسافة منتظمة يستخدم المهاد عادة للاحتفاظ برطوبة التربة ، ومنع نمو الأعشاب الضارة . يعتبر المهاد البلاستيكي أكثر كفاءة من المهاد العضوي في على الحقول خالية من الأعشاب الضارة . في بعض الأحيان ، يمكن استخدام مزيج من المهاد العضوي والبلاستيكي خلال الموسم الحف الحار .",
      'title' =>"قم بتغطية الأخاديد بالبلاستيك للحفاظ على الحقول خالية من الأعشاب الضارة",
]);

$step16 = Step::create([
    'plant_schedule_id' => 17,
    'stage_id' => 10,
    'interval' => 1,
    'image'=>"g9.png",
    'description' => "فيما يلي بعض التوصيات حول كيفية زراعة شتلات الباذنجان لتأمين تشأة جيدة للنباتات في الحقل : ري النباتات في الحضانة بكميات قليلة من الماء في اليوم السابق للزراعة .\r\n • اسحب الشتلات من تربة البذر بعناية ، واجمعها في وعاء ، . تأكد من أن النباتات الصغيرة لديها ما يكفي من التربة حول الجذور • إذا لزم الأمر ، قم بإزالة عدد قليل من الأوراق السفلي خلال عمليات الزرع لتنظيف المظلة الخضرية وصقل مظهرها .\r\n • ازرع النبات على عمق كافي ، بحيث تكون الأوراق فقط فوق سطح التربة .\r\n • اضغط على التربة بقوة حول الجذور للقضاء على جيوب الهواء ، التي قد تحول دون تلامس الجذور بالتربة .\r\n • التباعد الموصى به للأصناف الطبيعية هو 60 × 60 سم .\r\n • التباعد الموصى به للأصناف الهجينة فهو 90 × 60 سم .\r\n • اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن التي تناسب حقلك إذا كانت لديك شكوك . ",
      'title' => "كيفية زرع شتلات الباذنجان في حقلك "
]);



$step20 = Step::create([
    'plant_schedule_id' => 17,
    'stage_id' => 10,
    'interval' => 2,
    'image'=>"g11.png",
    'description' => "• نفذ عملية ملء الفجوات في غضون 10 أيام من أول عملية زرع .\r\n• قم بذلك خلال ساعات المساء أو في الأيام الملبدة بالغيوم لتقليل الصدمة إلى النباتات . \r\n• استخدم الشتلات التي احتفظت بها بعد تقليم الشتلات في الحضانة . وستكون الشتلات الإضافية مفيدة جداً في حال الحاجة إليها . \r\n• لا تنس أن تروي النباتات المزروعة حديثا .",
    'title' => "استخدام الشتلات الاضافية لسد الفجوات في الحقل"
]);


$step25 = Step::create([
    'plant_schedule_id' => 18,
    'stage_id' => 10,
    'interval' => 3,
    'image'=>"g14.png",
    'description' => "تتكون تربية نباتات الطماطم من إزالة النمو النباتي غير المرغوب به من أجل تقليل كثافة المظلة الخضرية ، وزيادة مقدار تعرض النبات للضوء ، وبالتالي تحسين احتمال نمو الثمار . كما يجب قطع الأوراق الموجودة عند قاعدة النباتات وحتى ارتفاع يتراوح بين 30-60 سم لتجنب انتقال الأمراض من التربة . مما يؤدي إلى زيادة العائد المبكر والجودة الكاملة من خلال القيام بذلك . كما أن تقليم الفروع والأوراق المريضة والتالفة من النبات يحسن أيضا من الصحة العامة للنبتة .",
    'title' => "ازالة النمو النباتي الغير مرغوب به لنمو فواكة جيدة"
]);
$step21 = Step::create([
    'plant_schedule_id' => 24,
    'stage_id' => 10,
    'interval' => 3,
    'image'=>"tt13.png",
    'description' => "السماد الحيواني أو المستخلصات النباتية على نسبة عالية يحتوي من العناصر الغذائية ، مما يجعلها مصدرا كبيرا لتخصيب النباتات . إن الأسمدة السائلة مفيدة للغاية لتطبيقها على الحقول في هذه المرحلة وستدعم تطوير الزهور والثمار . إليك بعض التوصيات : • تأكد • ضع السماد السائل في ساعات الصباح قبل أن تسخن الشمس . تخفيف المستخلصات النباتية ، على الأقل 10 مرات ( جزء واحد من السماد / 9 أجزاء من الماء ) . من تأكد من تخفيف السماد الحيواني ، على الأقل 15 مرة ( جزء واحد من السماد / 14 جزء من الماء ) .\r\n • قم بتطبيق السماد حول قاعدة النبات ، ولكن تجنب رشه على النباتات . \r\n• اسأل مسئول الإرشاد أو بائع التجزئة المحلي عن المزيج الأنسب لأغراضك .",
     'title' => "قم بتطبيق السماد السائل لدعم نمو النبات"
]);



$step22 = Step::create([
    'plant_schedule_id' => 25,
    'stage_id' => 10,
    'interval' => 3,
    'image'=>"g12.png",
    'description' => " الباذنجان هو محصول طويل المدة ، ويحتاج إلى كمية جيدة من الأسمدة لإنتاجية عالية . تعتمد كمية الأسمدة المضافة إلى حد كبير على عوامل مثل نوع النبات ( الأصناف الطبيعية أو الهجينة ) ونوع التربة والظروف الجوية . فيما يلي بعض التوصيات بشأن الباذنجان حقلك : • يتم تطبيق القسم الأول من التطبيق المجزأ بعد حوالي 20-35 يوما من عملية الزرع .\r\n • يشمل ذلك إضافة 14 الكمية المطلوبة من النيتروجين ، والتي تبلغ حوالي 20-30 كجم / فدان من اليوريا .\r\n • ضع حبيبات السماد حول قاعدة النبات ، وتجنب ملامستها للجذع . تأكد . من إثارة التربة وركمها حول قاعدة النبات .\r\n • إذا لم يكن من المتوقع هطول أمطار ، فلا تنس أن تقوم بري المحصول .\r\n • اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن المزيج المغذي الأنسب للنباتات في حقلك .",
     'title' => " تطبيق القسم الأول من التطبيق الانقسامي ( المجزأ ) للنيتروجين"
]);



$step24 = Step::create([
    'plant_schedule_id' => 19,
    'stage_id' => 10,
    'interval' => 4,
    'image'=>"tt8.png",
    'description' =>"قد يظهر في هذة المرحلة بعض الامراض مثل مرض خنفساء سوسة او النطاطات او التربس او الذبول البكتيري",
      'title' => "راقب حقلك"
]);

////////////////////

$step29 = Step::create([
    'plant_schedule_id' => 4,
    'stage_id' => 11,
    'image'=>"g17.png",
    'interval' => 1,
    'description' => "قم بمراقبة نمو محصولك بشكل منتظم ومتكرر . قم بالمشي بين الصفوف الزراعية بطريقة عشوائية أو متعرجة ، وتحقق من - علامات وأعراض الأمراض أو الآفات أو مشاكل النقص . وتظهر أوجه القصور ونقص مقومات الحياة على هيئة تغير يطرأ على لون الأوراق وضعف قوة وحيوية النباتات . أما الأمراض ، فغالبا ما تكون مرئية على هيئة تغير في اللون أو تبقع أو تلون على هيئة خطوط طولية أو عرضية على الأوراق أو السيقان أو الجذور . أخيرا ، تذكر أن معظم الحشرات الموجودة في الحقل مفيدة لمحصولك . أما الضارة منها ، فهي تهاجم محصولك تاركة وراءها على الأوراق والبراعم على هيئة ثقوب . تأكد . التحدث مع جيرانك وتبادل المعلومات حول الأمراض الحالية مع مجتمعك المحلي . ابحث أيضا عن الدعم من موفري من خدمات الإرشاد الزراعي العام في منطقتك .",
    'title' => "راقب الحقل بشكل منتظم ومتكرر"
]);


$step24 = Step::create([
    'plant_schedule_id' => 19,
    'stage_id' => 11,
    'interval' => 2,
    'image'=>"tt9.png",
    'description' =>"قد يظهر في هذة المرحلة بعض الامراض مثل مرض البياض الدقيقي او النطاطات او التربس او المن ",
      'title' => "راقب حقلك"
]);

$step24 = Step::create([
    'plant_schedule_id' => 25,
    'stage_id' => 12,
    'interval' => 1,
    'image'=>"g12.png",
    'description' =>" الباذنجان هو محصول طويل المدة ، ويحتاج إلى كمية جيدة من الأسمدة لإنتاجية عالية . تعتمد كمية الأسمدة المضافة إلى حد كبير على عوامل مثل نوع النبات ( الأصناف الطبيعية أو الهجينة ) ونوع التربة والظروف الجوية . فيما يلي بعض التوصيات بشأن الباذنجان حقلك : . يتم تطبيق القسم الثاني من التطبيق المجزأ بعد حوالي 50-65 يوما من عملية الزرع .\r\n • يشمل ذلك إضافة 4 % الكمية المطلوبة من النيتروجين ، والتي تبلغ حوالي 20-30 كجم / فدان من اليوريا .\r\n • قم بوضع حبيبات السماد حول قاعدة النبات ، وتجنب ملامستها للجذع .\r\n . تأكد من إثارة التربة وركمها حول قاعدة النبات .\r\n . إذا لم يكن من المتوقع هطول أمطار ، فلا تنس أن تقوم بري المحصول .\r\n • اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن المزيج المغذي الأنسب للنباتات في حقلك . ",
     'title' => " تطبيق القسم الثاني من التطبيق الانقسامي ( المجزأ ) للنيتروجين"
]);


$step24 = Step::create([
    'plant_schedule_id' => 25,
    'stage_id' => 12,
    'interval' => 1,
    'image'=>"g15.png",
    'description' =>" عادة ما يتم إضافة العناصر الغذائية الثانوية والمغذيات الدقيقة بعد اختبار التربة أو بعد اكتشاف نقص في محصولك . حيث أن نقص البورون والحديد والزنك والمنغنيز والكالسيوم هي أكثر حالات النقص شيوعا . يمكن تطبيق التسميد على هيئة إضافة على جانبي مهاد البذور ( ممزوج بالرمل ) حول قاعدة النبات ، أو كرذاذ ورقي . وهذا يعتمد على المغذيات نفسها ، والظروف الجوية ، وشدة النقص . فيما يلي بعض التوصيات الأخرى بشأن المنتجات التي يمكنك استخدامها • يمكن إضافة الكالسيوم على هيئة نترات الكالسيوم أو محاليل كلوريد الكالسيوم ( 3 جم / لتر ) .\r\n • يتم رش المغنيسيوم على هيئة محلول سلفات المغنيسيوم ( 3 جم لتر ) .\r\n • يتم رش الحديد على هيئة محلول كبريتات الحديد ( 2 جم / لتر ) . يتم إضافة البورون عادة على التربة قبل بذر البذور على هيئة بوراکس ( 800 جم / فدان ) ، ممزوج بالرمل . عادة ما يتم رش الزنك على هيئة محلول سلفات الزنك ( 2 جم / لتر ) .\r\n • يتم رش الموليبدينوم عادة على هيئة محاليل موليبدات الصوديوم أو الأمونيوم ( 2 جم / لتر ) . اسأل ضابط الإرشاد أو تاجر التجزئة المحلي عن مزيج المغذيات الدقيقة الأنسب لحاجاتك .",
     'title' =>"كيفية إضافة المغذيات الدقيقة إلى النباتات في حقلك",
]);


$step24 = Step::create([
    'plant_schedule_id' => 19,
    'stage_id' => 12,
    'interval' => 2,
    'image'=>"tt10.png",
    'description' =>"قد يظهر في هذة المرحلة بعض الامراض مثل مرض الاكاروس ونقص الفسفور وحفار براعم وثمار الباذنجان والذبابة البيضاء ",
      'title' => "راقب حقلك"
]);



$step24 = Step::create([
    'plant_schedule_id' => 29,
    'stage_id' => 13,
    'interval' => 1,
    'image'=>"tt11.png",
    'description' =>"راقب الثمار بعناية ، وتأكد من انتقائها وفقا لمتطلبات السوق . تذكر أن الثمار تبدأ بكونها صالحة للأكل حين تصل إلى ثلث حجمها في النمو حتى تصل إلى الحجم الكامل . ومع ذلك ، فإن العائق الرئيسي هو أنها تتحلل وتتعفن بسرعة كبيرة . إليك بعض التوصيات الأخرى : تکییف وقت الحصاد حسب ما يفضله السوق : الاستهلاك الطازج ، المعالجة ، إلخ .\r\n • يجب نقل المحصول الطازج على الفور في شاحنات صغيرة إلى الأسواق المحلية • يتم تصنيف الفواكه القابلة للتسويق إلى فئات مختلفة حسب الحجم أو الشكل أو اللون . يبدو أن الحجم المفضل عند البيع بالتجزئة للباذنجان هو الثمار صغيرة الحجم .\r\n • تحدث إلى جيرانك وتجار التجزئة والمستشارين الزراعيين حول أفضل طريقة لتسويق محصولك .\r\n • كن على دراية بالدورات والندوات حول القرارات الحكومية المتعلقة بالمحصول الذي تقوم بزراعته .",
    'title' => " اتصل بالمشترين / تجار التجزئة ، واستعد لبيع محصولك"
]);

$step24 = Step::create([
    'plant_schedule_id' => 29,
    'stage_id' => 13,
    'interval' => 1,
    'image'=>"tt14.png",
    'description' =>"سيتم إنتاج كميات وفيرة إذا تم حصاد الثمار قبل أن تصل إلى الحجم الكامل بشرط أن تكون ذات لون مناسب وحجم جيد . لا يتزامن إنتاج الفواكه بين النباتات في فترة واحدة ، لذلك عادة ما يكون الحقل مليئًا بالنباتات التي تحتوي على الثمار والزهور في نفس الوقت . فيما يلي بعض التوصيات لتحديد موعد حصاد الباذنجان : • يجب حصاد الثمار عندما تكون أقل من الحجم الكامل ( 34 الحجم النهائي للنمو ) .\r\n • اضغط برفق على الثمرة بإبهامك ، إذا لم يعد الجلد بسرعة إلى ما كان عليه ، فذلك يعني أن الثمار جاهزة للقطف . يعني • إن علامة جودة الثمار هي كون جلدها لامعاً وناعماً ، مما ستباع بقيمة أفضل في الأسواق .\r\n • إذا تركت الثمار لتنضج أكثر من اللازم ، فسيكون لديها بشرة خشنة وقد تصبح البذور خشنة ، وتفقد جودتها .\r\n • لا تخزن الفواكه لفترات زمنية طويلة ، وتجنب درجات حرارة التخزين التي تقل عن 10 درجات مئوية .",
     'title' => " متى يفضل حصاد الباذنجان"
    ]);


    $step24 = Step::create([
        'plant_schedule_id' => 29,
        'stage_id' => 13,
        'interval' => 2,
        'image'=>"tt14.png",
        'description' =>"يتم قص الثمار من النبات ، تاركة الكأس الموجودة في قمة الثمرة مع جزء من العنق متصلاً بالثمرة ، وتوضع في صناديق كبيرة الحجم أو صناديق قابلة للتكديس . إليك المزيد من التوصيات المتعلقة بأدواتك • استخدم الصناديق الكبيرة والصناديق القابلة للتكديس ذات الجدران الداخلية الناعمة لمنع خدش الثمار .\r\n • نظرا لأنه يجب قص الثمرة من النبات ، استخدم أي أداة قطع حادة .\r\n • يمكن تنظيم النقل من الميدان إلى السوق أو مرفق التخزين في جرار أو مقطورة صغيرة .\r\n • ستحتاج أيضا إلى محلول تعقيم لتنظيف أدوات الحصاد المستخدمة .",
          'title' => "جهز أدوات الحصاد ونظفها جيداً"
        ]);

        $step24 = Step::create([
            'plant_schedule_id' => 29,
            'stage_id' => 13,
            'interval' => 2,
            'image'=>"tt14.png",
            'description' =>" يجب حصاد الثمار يدويا ، وقصها من النبات باستخدام سكين أو بمقصات التشذيب ( التقليم ) ، وترك كأس الثمرة وقطعة قصيرة من العنق سليمة مع الفاكهة . ولكن لا تسحب الفاكهة من النبات ، لأن هذا سوف يتسبب في أضرار كبيرة . تكون الفاكهة عالية الجودة خالية من الجروح السطحية أو الكدمات ، ولا تظهر بقعاً أو تقرحات تدل على أي إصابة . فيما يلي المزيد من التوصيات المتعلقة بقطف ثمار الباذنجان حصاد الثمار بالطريقة الصحيحة • اقطف واجمع الفواكه في صناديق صغيرة قابلة للتكديس ، أو الأكياس القطنية ، أو صناديق الخشبية أو الكرتونية التعبئة والتعامل مع الأصناف وتصنيفها بشكل منفصل من • بمجرد امتلاء الصناديق القابلة للتكديس ، قم بتعبئتها في صناديق واسعة ضحلة قابلة للتكديس لتخزينها لاحقاً .\r\n • احتفظ بالصناديق القابلة للتكديس في الظل لتقليل الإجهاد الناتج عن درجات الحرارة العالية وتلف الثمار .\r\n • لا تملأ الصناديق زيادة عن سعتها ، لأن ذلك قد يؤدي إلى التلف الضغط . الناجم عن • تنظيف وتعقيم معدات القطف في نهاية كل يوم من أيام الحصاد للوقاية من الأمراض .",
             'title' => "تأكد من حصاد الثمار بالطريقة الصحيحة"
            ]);

            $step24 = Step::create([
                'plant_schedule_id' => 30,
                'stage_id' => 14,
                'interval' =>1,
                'image'=>"tt15.png",
                'description' =>"يتم فرز الفواكه عموما وفقا للشكل واللون . وبالتالي ، عليك التأكد ، جمع وتعبئة أنواع مختلفة في حاويات مختلفة . يمكن تخزين الفواكه لمدة تصل إلى 7-10 أيام عند درجة حرارة 7-10 درجة مئوية والرطوبة بنسبة 90-95 ٪ . أقل من 7 درجات مئوية قد يتسبب في إصابة الثمار بالنطع الناتج عن الصقيع ، وتكون مرئية بشكل رئيسي . فتح الثمار . أعراض الإصابة بالبرودة الزائدة هي : انتشار النطوع ، وتبقع برونزي على السطح ، واللون البني في البذور واللب .",
                 'title' => "تأكد من تخزين الباذنجان بشكل صحيح "
                ]);
                $step24 = Step::create([
                    'plant_schedule_id' => 21,
                    'stage_id' => 14,
                    'interval' => 1,
                    'image'=>"fieldPreparation1.png",
                    'description' =>"تأكد من إزالة جميع مخلفات المحاصيل بعد الحصاد لتجنب احتمال إعادة ظهور المرض في نفس الحقل . أما في حالة انتشار الآفات ، فاحرث الأرض مع تقليب التربة لتعريض الحشرات للحيوانات المفترسة والتعقيم بالإشعاع الشمسي ( التشميس ) . فكر في استخدام المحاصيل الغطائية بين الفصول لزيادة محتوى الكربون العضوي ورطوبة التربة . أخيرا ، فكر في ترك الحقل في حالة البور لفترة من الوقت لتعزيز إمكانياته .",
                     'title' => "قم بإجراءات الإدارة الحقلية المناسبة بعد الحصاد"
                    ]);
                    
                    $step24 = Step::create([
                        'plant_schedule_id' => 20,
                        'stage_id' => 14,
                        'interval' => 2,
                        'image'=>"tt17.png",
                        'description' =>"تناوب المحاصيل هو ممارسة زراعة محاصيل مختلفة في نفس الحقل في مواسم متتابعة \r\n. يساعد ذلك على زيادة صحة التربة والخصوبة ، ويمنع أيضاً نقل بعض الأمراض \r\n. أبسط قاعدة هي تقوم بزراعة محصول فوق الأرض ثم محصول تحت الأرض ، ولكن تجنب تناوب المحاصيل التي تنتمي إلى نفس العائلات \r\n. أن فيما يلي بعض مجموعات المحاصيل التي لها تناوب ينصح اتباعه :\r\n • الباذنجانيات : الطماطم ، البطاطس ، الفلفل ، الفليفلة ، الفلفل الحار ، والباذنجان • الخضروات الصليبية : الكرنب ، القرنبيط ، البروكلي ، كرنب بروكسل ، والكرنب المجعد • المحاصيل الجذرية : جذر الشمندر والجزر والجزر الأبيض ، ولحية التيس ، واللفت • \r\nالبقوليات : الفول ، الفول السوداني ، والحمص ، والبازلاء ( ينصح بشدة بتعزيز مستويات النيتروجين ) \r\n• القرعيات : الخيار ، القرع العسلي ، القرع الصيفي ، ومختلف أنواع البطيخ •\r\n محاصيل أخرى : مثل السلق ، السبانخ والخس ، والهندباء الأنديفية\r\n ، والخرشوف يمكن أن تدرج في أي مكان \r\n، ما لم تشكل مناوبتها خطراً على المحصول الآخر \r\n. يعد التناوب الدقيق للمحاصيل إلزاميا بعد زراعة البازلاء والبطاطس",
                         'title' => "اتبع المناوبة الصحيحة للمحاصيل "
                        ]);





                        $step1 = User::create([
                            'name' => "Mohammad",
                            'email' => "test1@mm",
                            'password' => bcrypt("123456"),
                            'location'=>"Tafas",
                            'phone' =>"0999813456",
                               'about' => "أنا المزارع محمد من سوريا",
                        ]);

                        $step1 = User::create([
                            'name' => "Omar",
                            'email' => "test2@mm",
                            'password' =>bcrypt("123456"),
                            'location'=>"damascus",
                            'phone' =>"0948848071",
                               'about' => "أنا المزارع عمر من سوريا",
                        ]);

                        $step1 = User::create([
                            'name' => "Ali",
                            'email' => "test3@mm",
                            'password' =>bcrypt("123456"),
                            'location'=>"damascus",
                            'phone' =>"0948848071",
                               'about' => "أنا المزارع علي من سوريا",
                        ]);

                        $step1 =Post::create([
                            'user_id' => 1,
                            
                            'title' => "بجفاف البتلات في شجره الجوافة",
                        
                        'content' => "السلام عليكم ورحمة الله وبركاته وبعد
                        أنا عندي شجرة جوافة عمرها تقريبا اربع سنوات وبداءت تزهر ولكني لاحظت بجفاف البتلات وأصبح لونها بني فما السبب وكيف اعالج هذه المشكلة وشكرا",
                    ]);
                    $step1 =Comment::create([
                        'user_id' => 2,
                        
                        'post_id' => 1,
                    
                    'content' => "ضعف النبات وعدم توفر إحتياجاته من الغذاء تجعله غير قادر على إكمال دورة تكوين الثمار بشكل جيد - رجاء ذكر المعاملات التي تقوم بها معها من تسميد ومكافحة وري"
                 ]);

                 $step1 =Comment::create([
                    'user_id' => 1,
                    
                    'post_id' => 1,
                
                'content' =>"السلام عليكم ورحمه الله وبركاته
                أنا ليس عندي برنامج محدد للتسميد أو مكافحة كيميائية.
                ولكن أنا وضعت في شهر يناير الماضي سماد بلدي حوالي كيلوا الي اثنين في التربة على بعد ٥٠سم تقريبا من الجذع ومن قبل ذلك كنت وضعت سوبر فوسفات حوالي ربع كيلوا وخلطها بالتربة في نفس الجورة.
                ايضا كنت قطعت ساق سميك من جذع الشجرة من ناحية الجذور التي في الأرض وذلك لتحسين شكل الشجرة وايضا لجعلها تثمر بشكل أفضل.
                
                - -- - - تم تحديث المشاركة بما يلي - - - - - -
                
                السلام عليكم ورحمه الله وبركاته
                أنا ليس عندي برنامج محدد للتسميد أو مكافحة كيميائية.
                ولكن أنا وضعت في شهر يناير الماضي سماد بلدي حوالي كيلوا الي اثنين في التربة على بعد ٥٠سم تقريبا من الجذع ومن قبل ذلك كنت وضعت سوبر فوسفات حوالي ربع كيلوا وخلطها بالتربة في نفس الجورة.
                ايضا كنت قطعت ساق سميك من جذع الشجرة من ناحية الجذور التي في الأرض وذلك لتحسين شكل الشجرة وايضا لجعلها تثمر بشكل أفضل.
                بالنسبة للتربة فهي رملية وكنت وضعت من قبل كمية من التراب الاسود وخلطها بها.
                بالنسبة للري فانا اسقي كل أسبوع بمقدار ٢٤لتر تقريبا دفعة واحدة أو على دفعتين"
                ]);

                $step1 =Comment::create([
                    'user_id' => 2,
                    
                    'post_id' => 1,
                
                'content' => "وعليكم السلام ورحمة الله وبركاته

                للاسف ما تم وضعه للشجرة لا يفي بإحتياجاتها تماما وهذا ما ادي لمشاكل في العقد
                
                فالشجرة تحتاج الى مقطفين سباخ بلدي تام التحلل مضاف اليه نصف كيلو سوبر فوسفات خلال فترة الشتاء
                
                وتحتاج الى إضافة 100جرام سلفات نشادر في منتصف مارس وتكرر نفس الكمية في اوائل يوليو
                وتحتاج الى 250 جرام سلفات بوتاسيوم في منتصف مارس وتكرر نفس الكمية في اوائل يوليو
                
                ولا نضع سلفات النشادر وسلفات البوتاسيوم في نفس اليوم بل بينهما فاصل برية
                
                وتحتاج الى رش عناصر صغرى على الاوراق مرة كل شهرين وتباع هذه العناصر مجتمعة مع بعض"
              ]);

              $step1 =Comment::create([
                'user_id' => 1,
                
                'post_id' => 1,
            
            'content' => "شكا استاذ   للمعلومات واضيف واكرر تنظيم تسميد وتنظيم في الري اهم شيء"
           ]);





                    $step1 =Post::create([
                        'user_id' => 2,
                        
                        'title' => "ذبول واصفرار في اوراق الذرة الحمراء",
                    
                    'content' => "مشكلتي مع الذرة الحمراء وهي لاول مرة ارى هذه المشكله علما بأني زرعتها في أرض جديدة بعد حراثتها مباشرة حيث ان الارض اقرب الى رملية نسبة PH=8 والاملاح تصل الى 950 هل تحتاج الى سماد و اي نوع"
                
                ]);



                $step1 =Comment::create([
                    'user_id' => 3,
                    
                    'post_id' => 2,
                
                'content' => "اهلا وسهلا بحضرتك وكل عام وانت بالف
                اولا انت زرعتها لما حراثة ارض
                ثانيا اعمل تسميد حسب هلمعلومات وكذلك الري بما انها رملية جيدة تصريف
                
                التسميد Fertilization:-
                يضاف السماد البلدى بمعدل 20-30 م3 للفدان (خاصة عند الزراعة عقب المحاصيل النجيلية) أثناء إعداد الأرض للزراعة.
                يضاف السماد الفوسفاتى بمعدل 100-150 كجم سوبر فوسفات الكالسيوم الأحادى (15%) تنثر فى بطون الخطوط قبل مسحها.
                السماد الآزوتى :-
                يلزم إضافة 105 كجم آزوت للفدان وذلك عند زراعة الأصناف القصيرة والهجن الجديدة متوسطة الطول عالية الإنتاج ثنائية الغرض.
                الأصناف طويلة الساق :-
                يضاف لها 80 كيلو جرام آزوت للفدان و هي تعادل 175 كيلو جرام يوريا ( 46.5 % ) ، أو 250 كيلو جرام نترات نشادر ( 33.5%) ،أو 400 كيلو جرامسلفات نشادر ( 20.6 % ) .
                الأصناف و الهجن قصيرة الساق :-
                يضاف لها 100 كيلو جرام ازوت للفدان و هي تعادل 220 كيلو جرام يوريا تقريبا، أو 300 كيلو جرام نترات نشادر، أو 500 كيلو جرام سلفات نشادر .
                و يراعى :- في أراضي الوادي : إضافة السماد الآزوتي تكبيشا أمام الجور على دفعتين متساويتين الأولي قبل رية المحاياة والثانية قبل الرية الثانية .
                في الأراضي الرملية و المستصلحة حديثا يضاف السماد الآزوتي تكبيشا أمام الجور على دفعات عديدة .
                يراعى عدم استخدام اليوريا في الأراضي الرملية و الجيرية لانخفاض معدل الاستفادة منها.
                في حالة الزراعة عقب المحاصيل النجيلية يراعى زيادة الكميات المضافة بنسبة 2 % .
                في حالة إضافة الأسمدة البلدية تخفض الأسمدة الآزوتية المضافة بنسبة 20 % .
                
                السماد البوتاسى :-
                يضاف سماد سلفات البوتاسيوم (48%بو2أ) بمعدل 50كجم للفدان وذلك عند زراعة الهجن الجديدة عالية الإنتاج، وفى الأراضى حديثة الإستصلاح يضاف تكبيشاً قريباً من الجور مع الدفعة الأولى للسماد الآزوتى قبل رية المحاياه مباشرة.
                الأسمدة الورقية :-
                لوحظ استجابة نباتات الذرة الرفيعة للتسميد الورقي بعنصري الزنك والحديد على أن يكون الرش بمعدل 0.5جرام زنك مخلبي، 3 جرام كبريتات حديدوز لكل لتر ماء بعد 40– 55 يوما من الزراعة، و تكون كمية مياهالرش حوالي 200 – 300 لتر ماء للفدان، و يراعى إجراء الرش في الصباح الباكر أو عند الغروب .
                الرى Irrigation :-
                تكون ريه الزراعة على البارد مع الغمر الكامل للأرض بالماء لضمان إكتمال الإنبات.
                تعطى ريه المحاياه بعد ثلاثة أسابيع من ريه الزراعة بعد الخف وإضافة الدفعة الأولى للسماد الآزوتى.
                ثم ينظم الرى بعد ذلك كل 12-14 يوماً حسب عمر النبات ودرجة حرارة الجو ونوع التربة، حيث تقل المدة بالأراضى الرملية وبإرتفاع الحرارة وتقدم النبات فى العمر.
                ويوقف الرى قبل الحصاد بحوالى 15-20 يوماً للمساعدة على جفاف الرؤوس والقناديل وتلافيا للرقاد الذى يسبب تعفن الرؤوس والقناديل وإنبات الحبوب عند ملامستها للتربة.
                ويجب أن يتم الرى بالحوال لإحكام الرى فلا تغريق ولا تعطيش للنباتات فكلاهما له أسوأ الأثر على المحصول ، حيث يؤدى:
                1-التغريق:- إلى إختناق الجذور (لعدم قدرتها على التنفس) وإصفرار المجموع الخضرى وضعفه (لعدم قدرة النبات على الإستفادة من المواد الغذائية بالتربة) وكذلك غسيل الأسمدة وفقدانها مع مياه الصرف.
                2-أما التعطيش:- فيؤدى إلى ذبول النباتات وموتها خصوصاً فى فترة طرد النورات مما يؤدى إلى عدم تكوين الحبوب أو ضمورها وصغر حجم القناديل أو الرؤوس Heads وإنخفاض المحصول."
               ]);


           
               $step1 =Post::create([
                'user_id' => 3,
                
                'title' => "جفاف الأوراق القديمة في شتلة الليمون",
                'content'=>"قمت شتلة ليمونبدأت في الإزهار والعقد وبدأت في أخراج نموات جديدة ولكن بطيئة إلى حد مالكن مع بدأ أرتفاع درجات الحرارة وجدت أن الأوراق القديمة غالبا جميعها بدأت في الجفاف والتساقط
                هل يوجد حل لتلافي سقوط الأوراق أم هذا طبيعي؟"
              ]);

              $step1 =Comment::create([
                'user_id' => 1,
                
                'post_id' => 3,
            
            'content' => "وعليكم السلام ورحمة الله وبركاته

            غالبا المشكلة لديك نقص تغذية رجاء توضيح طريقة التسميد المتبعة لديكم"
         ]);

         $step1 =Comment::create([
            'user_id' => 2,
            
            'post_id' => 3,
        
        'content' => "طبيعي اوراق قديمة تتساقط المهم تسميد منتظم والري منتظم ولأنها شتلات جديدة وضعها في مكان جو معتدل لاتكن شمس قوية عليها"
    
    ]);

 

$step1 =Comment::create([
    'user_id' => 3,
    
    'post_id' => 3,

'content' => "أشكركم على المرور
هي لم يظهر التساقط السريع إلا بعد أشتداد الحر وهي شتلة مازالت في كيس الشتلات كما ترون ولا أنوي وضعها في وعاء أكبر إلا في الشتاء أن شاء الله

أقوم بتسميدها NPK متعادل كل 3 أسابيع وأضفت العناصر الصغري مرة واحدة هي لم يمر عليها معي غير شهر ونصف...

وصف النبات الساق قوية خشبية بسمك أكبر قليلا من القلم الرصاص تتفرع إلى فرعين أظن أنها عبارة عن جزء من شجرة أم ولم تكن من البذرة.."
]);


$step1 =Comment::create([
    'user_id' => 1,
    
    'post_id' => 3,

'content' => "اخي استاذ npk سماد كيمياوي اخذ حذر وقت اضافتها لاتكن قريبة من الشجررة بل حولها وبكمية قليلة لاتحرق اشجاركم بسماد كيمياوي تحياتي لحضرتكم

- -- - - تم تحديث المشاركة بما يلي - - - - - -

انا شتريت شجرة كبيرة كانت لاتعمل حتى اوراق بقيت اسقيها ومرات في شهر مرة اضيفها سماد رائتها الان حتى عملت تزهير وظهر اوراق صغيرة جدا بيها"
]);



$step1 =Comment::create([
    'user_id' => 3,
    
    'post_id' => 3,

'content' => "شجرة ليمون عندما اشتريتها لم تعمل اي ورقة جديدة ولم يبقى بيها اي ورقة قديمة بعد اعتناء يلتسميد والري جيد الان تعمل اوراق جديدة"
]);



$plant = Plant::create();
$plant->name = "البامية";
$plant->description = "نبات البامية: هي محصول موسمي دافئ وهو نبات طويل القامة، والزهرة فيه تشبه الكركديه التي نشأت في إفريقيا، وتعتبر القرون الصغيرة الغير ناضجة هي الجزء الصالح للأكل من هذا النبات، وهي عنصر مهم في المطبخ الجنوبي وكما يزرع هذا النبات في جميع أنحاء ولاية كارولينا الجنوبية.
\r\n \r\n تنمو البامية بشكل أفضل في درجات حرارة تتراوح بين (75 إلى 90) درجة فهرنهايت، وعند زراعة البامية يجب على البستانيون التأكد من أن درجة حرارة التربة دافئة بدرجة كافية حتى تنبت البذور وتبدأ في النمو، حيث يمكن أن تؤدي التربة الباردة إلى بطؤ النمو وأمراض الشتلات. وتعتبر درجة حرارة التربة المثلى لإنبات البذور في مكان ما بين (70 إلى 95) درجة فهرنهايت ؛ لذلك سيرغب البستانيون في فحص درجة حرارة التربة على عمق 4 بوصات قبل الزراعة. 
\r\n \r\n  إذا كانت درجة حرارة التربة أقل من 65 درجة فهرنهايت، على عمق 4 بوصات، يجب على البستانيين التوقف عن الزراعة حتى تصبح درجة حرارة التربة أكثر دفئًا، وكما يمكن زراعة المحصول في جميع أنواع التربة، على الرغم من أن التربة الطينية الرملية الغنية بالمواد العضوية هي الأكثر تفضيلاً، ومن المهم أيضاً أن تكون التربة جيدة التصريف.
\r\n \r\n يجب زراعة جميع المحاصيل بالتناوب للمساعدة في تقليل مشاكل الأمراض والديدان الخيطية، وكما أيضاً يجب ألا تتبع زراعة البامية المحاصيل المعرضة للديدان الخيطية مثل الطماطم والفلفل والقرع والبطاطا الحلوة؛ لأن نباتات البامية حساسة للديدان الخيطية (الديدان المجهرية) التي تدمر الجذور قد يقوم بعض المنتجين التقليديين بتبخير تربتهم، وهي عملية تضر أيضًا بالكائنات الحية الدقيقة المفيدة.
\r\n \r\n كما يتم استخدام مبيدات الآفات والأسمدة النيتروجينية الأخرى بشكل شائع لأستخدامها في زراعة البامية لزراعتها، فحاول شراء البامية من سوق المزارعين، حيث يمكنك التحدث إلى المزارعين حول استخدامهم للمواد الكيميائية. يضمن اختيار المواد العضوية المعتمدة حيثما كانت زراعة البامية بدون مبيدات حشرية وأسمدة صناعيةتشمل الآفات الحشرية التي تصيب البامية، حشرات المن ودودة أذن الذرة والبق النتن والبق الورقي أيضاً، وغالبًا ما تتغذى حشرات المن على عصارة نبات البامية ويمكن أن تجذب النمل، ويمكن أن يساعد الحد من النيتروجين وإدارته بشكل صحيح في إدارة حشرات المن والنمل. وغالبًا ما توجد ديدان أذن الذرة تأكل في قرن البامية، في حين أن الحشرات ذات الرائحة الكريهة والبق ذي الأرجل الورقية ستؤدي إلى التواء وتشويه القرون.

";
$plant->season = "spring";
$plant->image = "okra.png";
$plant->save();


$stage1 = Stage::create([
    'name' => "مرحلة ماقبل الشتلات",
    'plant_id' => $plant->id,
    'interval' => 4,
    'step' => 1,
    'image' =>'s1.png',
    'watering_period'=>3,
]);


$stage2 = Stage::create([
    'name' => "مرحلة الشتلات",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 2,
    'image' =>'s2.png',
    'watering_period'=>3,
]);


$stage3 = Stage::create([
    'name' => "مرحلة النمو",
    'plant_id' => $plant->id,
    'interval' => 7,
    'step' => 3,
    'image' =>'s3.png',
    'watering_period'=>5,
]);


$stage4 = Stage::create([
    'name' => "مرحلة الازهار",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 4,
    'image' =>'s4.png',
    'watering_period'=>5,
]);
$stage5 = Stage::create([
    'name' => "مرحلة الاثمار",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 5,
    'image' =>'s5.png',
    'watering_period'=>5,
]);
$stage6 = Stage::create([
    'name' => "مرحلة الحصاد",
    'plant_id' => $plant->id,
    'interval' => 4,
    'step' => 6,
    'image' =>'s6.png',
    'watering_period'=>4,
]);

$stage7 = Stage::create([
    'name' => "مرحلة مابعد الحصاد",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 7,
    'image' =>'s7.png',
    'watering_period'=>0,
]);

$plantSchedule1 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اختيار النبات",
    'image'=>"selectPlant.png",
]);

$plantSchedule2 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "الزراعة",
    'image'=>"farmer.png",
]);
$plantSchedule3 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "العناية بالنبات",
    'image'=>"training.png",
]);
$plantSchedule4 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "المراقبة",
    'image'=>"monitoring.png",
]);
$plantSchedule5 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اختيار الموقع",
    'image'=>"siteSelectoin.png",
]);
$plantSchedule6 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "تجهيز الحقل",
    'image'=>"fieldPreparation.png",
]);

$plantSchedule7 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "ازالة الاعشاب الضارة",
    'image'=>"weeding.png",
]);
$plantSchedule8 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "الري",
    'image'=>"lrrigation.png",
]);

$plantSchedule9 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "التسميد العضوي",
    'image'=>"organic.png",
]);

$plantSchedule10 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "التسميد الكيميائي",
    'image'=>"chemical.png",
]);
$plantSchedule11 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اجراء وقائي",
    'image'=>"preventive.png",
]);
$plantSchedule12 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "حماية النباتات: كيميائية",
    'image'=>"protection.png",
]);
$plantSchedule13 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "حماية النباتات: عضوية",
    'image'=>"protection2.png",
]);
$plantSchedule14 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "خلال الحصاد",
    'image'=>"harvesting.png",
]);
$plantSchedule15 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "بعد الحصاد",
    'image'=>"postHarvest.png",
]);


$plant = Plant::create();
$plant->name = "الذرة";
$plant->description = "يُفضّل زراعة نبات الذرة في المناطق الدافئة، والمدارية، وشبه المدارية، ممّا يُمكّنها من التعرّض لأكبر قدر من الأشعة الشمسية التي تحتاجها لنموّها، إذ تتطلّب عملية نموّ الذرة تربة دافئة، وخصبة، وعميقة، وذات تصريف جيد للمياه، على أن تتراوح درجة حموضتها (بالإنجليزية: PH) بين 6-6.8، إضافة إلى الرطوبة الكافية، ويجدر بالذكر أنّ نموّ نبات الذرة، وتلقيحه الذي يتمّ بواسطة الرياح يحتاج إلى وجود مساحة كبيرة
\r\n يجب مراعاة زراعة كل نوع من نبات الذرة في المواعيد المناسبة لنموّه، إذ تحتاج بعض الأصناف إلى درجات حرارة أعلى من غيرها، ممّا يفرض زراعتها في وقت معيّن، ويُمكن التحكّم بدرجة حرارة التربة من خلال تغطّيتها باستخدام مهاد من البلاستيك الأسود قبل أسبوع من الزراعة تقريباً، ممّا يؤدّي إلى رفع درجة حرارتها، وجعلها مناسبة لزراعة الصنف المحدّد، فمثلاً تحتاج الأصناف الحلوة إلى أن تصل درجة حرارة التربة التي ستزرع فيها إلى 18.3 درجة مئوية، بينما تحتاج بعض الأصناف الأخرى إلى ما لا يقلّ عن 12.7 درجة مئوية
 \r\n يجب تزويد نبات الذرة بالكمية اللازمة من المواد الغذائية الضروريّة له، وبالأخصّ عنصر النيتروجين، إذ يتمّ ذلك عن طريق استخدام الأسمدة، ويفضّل إجراء هذه العمليّة قبل فترة نموّ النبات التي تستمرّ لمدة 30-40 يوماً منذ زراعة البذور، وذلك لضمان استفادته من أكبر كمية ممكنة من النيتروجين، ويجدر بالذكر ظهور بعض العلامات على أوراق نبات الذرة، والتي تدلّ على وجود نقص في المغذّيات، فمثلاً عندما تظهر الأوراق باللون الأرجواني بدلاً من الأخضر الغامق فإنّ ذلك يُعدّ إشارة إلى نقص الفسفور، بينما يّعدّ ظهورها باللون الأخضر الفاتح إشارة إلى نقص النيتروجين
 \r\n  \r\n  أهمّ الآفات التي تصيب محصول الذرة:
 \r\n الدودة القارضة (بالإنجليزية: Cutworms
 \r\n خنفساء، أو برغوث الذرة
 \r\n  منّ أوراق الذرة
\r\n  عفن الساق الفيوزارمي
";
$plant->season = "spring";
$plant->image = "corn.png";
$plant->save();


$stage1 = Stage::create([
    'name' => "مرحلة ماقبل الشتلات",
    'plant_id' => $plant->id,
    'interval' => 4,
    'step' => 1,
    'image' =>'s1.png',
    'watering_period'=>3,
]);


$stage2 = Stage::create([
    'name' => "مرحلة الشتلات",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 2,
    'image' =>'s2.png',
    'watering_period'=>3,
]);


$stage3 = Stage::create([
    'name' => "مرحلة النمو",
    'plant_id' => $plant->id,
    'interval' => 7,
    'step' => 3,
    'image' =>'s3.png',
    'watering_period'=>5,
]);


$stage4 = Stage::create([
    'name' => "مرحلة الازهار",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 4,
    'image' =>'s4.png',
    'watering_period'=>5,
]);
$stage5 = Stage::create([
    'name' => "مرحلة الاثمار",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 5,
    'image' =>'s5.png',
    'watering_period'=>5,
]);
$stage6 = Stage::create([
    'name' => "مرحلة الحصاد",
    'plant_id' => $plant->id,
    'interval' => 4,
    'step' => 6,
    'image' =>'s6.png',
    'watering_period'=>4,
]);

$stage7 = Stage::create([
    'name' => "مرحلة مابعد الحصاد",
    'plant_id' => $plant->id,
    'interval' => 2,
    'step' => 7,
    'image' =>'s7.png',
    'watering_period'=>0,
]);

$plantSchedule1 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اختيار النبات",
    'image'=>"selectPlant.png",
]);

$plantSchedule2 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "الزراعة",
    'image'=>"farmer.png",
]);
$plantSchedule3 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "العناية بالنبات",
    'image'=>"training.png",
]);
$plantSchedule4 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "المراقبة",
    'image'=>"monitoring.png",
]);
$plantSchedule5 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اختيار الموقع",
    'image'=>"siteSelectoin.png",
]);
$plantSchedule6 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "تجهيز الحقل",
    'image'=>"fieldPreparation.png",
]);

$plantSchedule7 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "ازالة الاعشاب الضارة",
    'image'=>"weeding.png",
]);
$plantSchedule8 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "الري",
    'image'=>"lrrigation.png",
]);

$plantSchedule9 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "التسميد العضوي",
    'image'=>"organic.png",
]);

$plantSchedule10 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "التسميد الكيميائي",
    'image'=>"chemical.png",
]);
$plantSchedule11 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "اجراء وقائي",
    'image'=>"preventive.png",
]);
$plantSchedule12 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "حماية النباتات: كيميائية",
    'image'=>"protection.png",
]);
$plantSchedule13 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "حماية النباتات: عضوية",
    'image'=>"protection2.png",
]);
$plantSchedule14 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "خلال الحصاد",
    'image'=>"harvesting.png",
]);
$plantSchedule15 = PlantSchedule::create([
    'plant_id' => $plant->id,
    'title' => "بعد الحصاد",
    'image'=>"postHarvest.png",
]);





    }
}





